[
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "What is the fee structure for MBA in Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University offers a two-year MBA course under the affiliation of AKTU. The fee structure for an MBA is inclusive of various components. As per the official website, Galgotias University MBA fees range between INR 90,000 - INR 4.8 lakh. This range includes the Tuition Fee for both years. However, this information is sourced from the official website/ sanctioning body and is subject to change. For a detailed Galgotias University MBA fee structure, candidates are advised to visit the official website."
                }
            },
            {
                "@type": "Question",
                "name": "Is attendance compulsory for BTech at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, according to Galgotias University's official website, students must maintain a minimum of 75% attendance, for any courses offered at Galgotias University including BTech programme. Students who fail to comply with this 75% attendance rule will be debarred from taking the semester examinations. Those candidates will be declared failed for that particular academic year and will have to repeat the same year. Hence, students must comply with the aforesaid attendance rule."
                }
            },
            {
                "@type": "Question",
                "name": "Is it compulsory to appear for JEE Main for BTech programme offered by Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, candidates who have not appeared for JEE Main will be shortlisted based on their merit in the last qualifying exam i.e., Class 12 scores. Galgotias University inducts candidates to the BTech programme through merit or entrance exam. For admission through the entrance exam, candidates should have a valid score in JEE-Main or CUET based on which they will be selected for further admission round. Also, for admission through class 12 marks, candidates must have the required aggregate and subject-wise marks as specified in the university’s prospectus based on which they will be selected and will have to report to the admission cell at Galgotias University for document verification leading to final seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "What are the BBA specialisations offered by Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The university offers BBA in seven specialisations, namely Aviation Management, Business Analytics, Tourism & Travel, Banking, Financial Services and Insurance, Logistics and Supply Chain Management, etc. Candidates willing to take admission to the BBA programme at Galgotias University must have passed class 12 with a minimum of 50% aggregate. Candidates based on their score in class 12 will be selected for further admission round followed by document verification and fee payment leading to final seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "Does Galgotias University accept 12th marks?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotias University inducts candidates for the majority of its courses based on marks in the qualifying examinations. For admission to the UG programmes across various specialisations at Galgotias University candidates will get selected based on their marks in class 12 as the qualifying examination for UG courses is class 12. Hence, candidates seeking admission to the UG courses at Galgotias University must have valid marks in class 12. For admission to BTech and BA LLB, candidates are also selected based on their scores in JEE-Main and CLAT, respectively. Therefore, candidates based on their marks in class 12 or the required entrance examination will be selected for further admission rounds followed by document verification and fee payment leading to final seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "Is there any entrance exam at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The entrance exam accepted by Galgotias University include JEE Main/ UPSEE/ CLAT/ GMAT/ MAT/ CAT/ GMAT/ CMAT/ NMAT/ CUET. The university conducts Galgotias Engineering Entrance Examination (GEEE) for the BTech course and Galgotias University Management Aptitude Test (GUMAT) for the MBA course. Also, the university is also conducting counselling for CUET-specific courses. Candidates can proceed with the admission process for various UG courses through CUET UG scores by visiting the official website. Apart from the entrance exam candidates also needs to fulfil the eligibility criteria for the specific course."
                }
            },
            {
                "@type": "Question",
                "name": "Are admission 2024 open to Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University admissions 2024 are open currently. The university offers UG, PG, Doctoral, Certificates, Diploma and Integrated courses in the fields of Engineering, Business, Law, Arts, Sciences, Media & Communication etc. Eligible candidates can apply online on the official website of Galgotias University."
                }
            },
            {
                "@type": "Question",
                "name": "Is it compulsory to appear for JEE Main for BTech programme offered by Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, candidates who have not appeared for JEE Main will be shortlisted based on their merit in the last qualifying exam i.e., Class 12 scores. Galgotias University inducts candidates to the BTech programme through merit or entrance exam. For admission through the entrance exam, candidates should have a valid score in JEE-Main or CUET based on which they will be selected for further admission round. Also, for admission through class 12 marks, candidates must have the required aggregate and subject-wise marks as specified in the university’s prospectus based on which they will be selected and will have to report to the admission cell at Galgotias University for document verification leading to final seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "How to apply for Galgotias University admissions?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For Galgotias University admissions, students need to fulfil the eligibility criteria and successfully clear the entrance exams. Students can apply both online and offline to proceed with the admission process. Candidates need to pay an application fee of INR 1,100 for admission. To apply online, candidates need to register online by visiting the official website with basic details to generate login credentials. Then log in to fill out the application form and upload documents and pay the application fee. Finally, candidates need to submit the application form to proceed further with the admission process. Also, candidates should keep all the documents with them after applying online for further admission process. Some of these documents include Class 10, and Class 12 mark sheets and passing certificates, Migration certificate/ transfer certificate, Gap year affidavit, if applicable, Character certificate, Medical fitness certificate (original), Aadhaar card (mandatory), Four passport-size photographs, Entrance exam score/ rank card (If applicable), etc."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission for BBA at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, direct admission is valid for BBA course at Galgotias University. The university offers admission to candidates who fulfil the basic eligibility criteria for the course. For admission to BBA at Galgotias University, candidates are evaluated based on their merit of Class 12 and scores of CUET UG entrance exam. Aspirants must obtain minimum of 50 to 60% aggregate in the final examination of their higher class and submit their scores at the time of course registration."
                }
            },
            {
                "@type": "Question",
                "name": "Is BBA available at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotias University offers a full-time BBA (General) course for a duration of three years. Apart from this, the university also offers seven other industry-specific BBA courses. Students are also given option to pursue BBA (Hons in Research), which is a four-year long course taught in the full-time mode at Galgotias University. Find below all the three and four-year BBA courses along with their specialisations offered at Galgotias University: Aviation Management Marketing and Automobile Management Logistics and Supply Chain Management Business Analytics Banking, Financial Services and Insurance Tourism & Travel Financial Investment Analysis"
                }
            },
            {
                "@type": "Question",
                "name": "How to apply for BBA at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University BBA application process is conducted in an online mode. Candidates can visit the official website to apply for the course and pay an application fee before submitting the application form. Below are the detailed steps to fill Galgotias University BBA application form: Visit the official website, (galgotiasuniversity.edu.in). Click on 'Apply Now' on the home page. Register with basic details to generate login credentials. Login to fill the application form. Upload documents and pay the application fee of INR 1,100. Submit the application form."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fee structure of BBA at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University's fee structure for a BBA course is inclusive of various components. As per the official website, Galgotias University BBA fees for a three-year course is INR 2.85 lakh. Whereas the tuition fee for a four-year BBA course ranges between INR 3.8 Lacs to INR 4.2 lakh. Apart from the Tuition Fees, candidates also have to pay for the Security Deposit (Refundable) and Application Fees. Students who apply for accommodation have to pay separate charges. For a detailed Galgotias University MBA fee structure, candidates are advised to visit the official website."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get admission in Galgotias University for MBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Although, Galgotias University MBA admission is entirely entrance-based. However, as per the official website, some seats are filled through direct management quota. The university has reserved a few seats for later admission. Candidates who are willing to take admission via Management quota need to fulfil the minimum eligibility criteria and apply online on the official website. They can also contact directly to the admission counsellor at the admission office. Further, the best time to apply for direct admission is during the counselling process."
                }
            },
            {
                "@type": "Question",
                "name": "Is it worth to pursue MBA from Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Since the University is considered under a tier 3 tag, obviously there would exist some back draw with it. But, if you are willing to work hard in your respective field, it will definitely be worth it. MBA courses are among some of the demanded courses in the University for post-graduate studies. Students get a lot of related opportunities to make them capable of the current market. University will definitely give you a lot of opportunities, although the placement packages are about 4-5lakh (average & the highest is 13Lakhs) but at last, it just matters how much you are willing to work to the opportunities available. Wishing you luck!"
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission in Galgotias University for MBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Admission to MBA at Galgotias University is based on scores obtained in various national-level entrance exams. Candidates seeking admission to this course must qualify for any one of the following entrance exams: MAT CAT NMAT CMAT CUET-PG Further, a counselling process will be conducted at the university for the final seat allotment. Candidates whose names appeared on the merit list have to pay a certain amount of fee to lock their seat. In case, the seats get filled or students are found non-eligible for the course, the admission counsellor will interview the candidate for the second attempt. However, this information is based on unofficial sources. Candidates are advised to get clarity from the official website or the admission office of Galgotias University."
                }
            },
            {
                "@type": "Question",
                "name": "Is MBA available at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotia University offers a two-year full-time course of MBA in Dual Specialisations. Also, candidates can pursue MBA in further nine specialisations. Candidates willing to take admission to the MBA programme at Galgotias University must fulfil the following course requirements: Candidates must possess a bachelor’s degree in any discipline with a minimum of 50-55% aggregate. Candidates based on their graduation marks will be selected for further admission rounds. Selected candidates will have to report to the admission cell at Galgotias University for document verification and fee payment."
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission to BTech at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University offers admission to BTech programme based on merit or entrance exam scores. The university considers the Class 12 merit of the aspirants for BTech course. Aspirants with a valid score in JEE Main or CUET are also eligible for BTech admission. Besides, candidates must also complete Class 12 with a minimum of 60% aggregate in Physics, Chemistry & Mathematics for BTech course."
                }
            },
            {
                "@type": "Question",
                "name": "What is the eligibility criteria for BTech admissions at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The eligibility criteria for BTech admissions at Galgotias University is that candidates should have passed Class 12 with a minimum of 50 - 60% aggregate. Also, Galgotias University conducts Galgotias Engineering Entrance Examination (GEEE) for the BTech programme. The duration of these courses is from 3 to 5 years. Moreover, the fee for the BTech programme ranges between INR 1.44 Lacs - INR 5.40 lakh. Some of the streams of the BTech programme include Computer Science Engineering, Artificial Intelligence and Data Science, Artificial Intelligence & Machine Learning, Civil Engineering, Electrical Engineering, Electronics & Communication Engineering, Electrical & Electronics Engineering, Mechanical Engineering, etc."
                }
            },
            {
                "@type": "Question",
                "name": "Is BTech available at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotias University offers a four-year full-time BTech programme across four specialisations and various sub-specialisations. Candidates seeking admission to the BTech programme at Galgotias University must have passed class 12 with a minimum of 50% marks in Physics, Chemistry and Mathematics. Galgotias University inducts candidates to the BTech programme through merit or entrance exam. For admission through the entrance exam, candidates should have a valid score in JEE-Main or CUET based on which they will be selected for further admission round. Also, for admission through class 12 marks, candidates must have the required aggregate and subject-wise marks as specified in the university’s prospectus based on which they will be selected and will have to report to the admission cell at Galgotias University for document verification leading to final seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "Is attendance compulsory for BTech at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, according to Galgotias University's official website, students must maintain a minimum of 75% attendance, for any courses offered at Galgotias University including BTech programme. Students who fail to comply with this 75% attendance rule will be debarred from taking the semester examinations. Those candidates will be declared failed for that particular academic year and will have to repeat the same year. Hence, students must comply with the aforesaid attendance rule."
                }
            },
            {
                "@type": "Question",
                "name": "What is eligibility criteria for BSc at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates willing to take admission to the BSc programme at Galgotias University must fulfil the eligibility and selection criteria mentioned below: Candidates must have passed class 12 in the Science stream with a minimum of 50% aggregate. Candidates based on their marks in class 12 will be selected for further admission process and will be required to report to the admission cell at Galgotias University for document verification and fee payment leading to final seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "Is BSc available at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotias University offers a three-year full-time BSc programme across ten specialisations and multiple sub-specialisations. Candidates willing to take admission to the BSc programme at Galgotias University must have passed class 12 in the Science stream with a minimum of 50% aggregate. Candidates based on their class 12 marks will be selected for further admission rounds and will have to report to the admission cell at Galgotias University for document verification and tuition fee payment after which the seat in the opted programme will be locked for the candidate."
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/greater-noida",
                    "name": "Colleges in Greater Noida"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105",
                    "name": "Galgotias University Greater Noida"
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/admission",
                    "name": "admission"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "Galgotias University Course Admissions 2025: Fees, Eligibility, Fees, Dates & Scholarships",
        "description": "Know about complete Galgotias University admission 2025 details around fees, courses, selection criteria, etc.",
        "dateModified": "2025-01-28T17:21:00+05:30",
        "datePublished": "2024-10-04T15:11:37+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/admission",
            "@type": "WebPage",
            "name": "Galgotias University"
        },
        "author": {
            "@type": "Person",
            "name": "RohiniPandey",
            "url": "https://www.shiksha.com/author/Rohini837338916"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1569477243php7w52lR.jpg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]