[
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "What is the fees for the BTech course at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total tuition fee for the BTech course at Galgotias University ranges from INR 1.40 lakh to INR 6 lakh. The duration of the course is between 3-5 years. The university usually conducts GEEE to shortlist candidates for the BTech programme. Candidates who have passed UPSEE/ JEE Main can also apply. Find below the eligibility and selection criteria for BTech courses: Selection criteria: Merit-based Eligibility for BTech/ BTech (Hons): A pass in Class 12 with a minimum of 60% aggregate in Physics/ Chemistry/ Mathematics. Eligibility for BTech in Agriculture Engineering: A pass in Class 12 in PCM/ PCB with at least 60% aggregate."
                }
            },
            {
                "@type": "Question",
                "name": "Is there any entrance exam at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The entrance exam accepted by Galgotias University include JEE Main/ UPSEE/ CLAT/ GMAT/ MAT/ CAT/ GMAT/ CMAT/ NMAT/ CUET. The university conducts Galgotias Engineering Entrance Examination (GEEE) for the BTech course and Galgotias University Management Aptitude Test (GUMAT) for the MBA course. Also, the university is also conducting counselling for CUET-specific courses. Candidates can proceed with the admission process for various UG courses through CUET UG scores by visiting the official website. Apart from the entrance exam candidates also needs to fulfil the eligibility criteria for the specific course."
                }
            },
            {
                "@type": "Question",
                "name": "Does Galgotias University accept 12th marks?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotias University inducts candidates for the majority of its courses based on marks in the qualifying examinations. For admission to the UG programmes across various specialisations at Galgotias University candidates will get selected based on their marks in class 12 as the qualifying examination for UG courses is class 12. Hence, candidates seeking admission to the UG courses at Galgotias University must have valid marks in class 12. For admission to BTech and BA LLB, candidates are also selected based on their scores in JEE-Main and CLAT, respectively. Therefore, candidates based on their marks in class 12 or the required entrance examination will be selected for further admission rounds followed by document verification and fee payment leading to final seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission to MCA at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, direct admission is valid for MCA at Galgotias University. Candidates are offered admission based on their merit obtained in the last qualifying exam of degree. There is no requirement to qualify for any entrance exam. Aspirants can apply directly on the admission portal of Galgotias University. They also have to submit their scorecards and marksheet of Class 12 and graduation as a supporting documents of previous education."
                }
            },
            {
                "@type": "Question",
                "name": "Is Galgotias University a good option for BBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University offers BBA courses in top specialisations of the field, which is inclusive of Aviation Management, Business Analytics, Tourism & Travel Management, etc. Moreover, students can also pursue four-year courses in BBA (Hons in Research) programmes. The university offers impressive scholarships to students to meritorious students and 100% tuition fee waivers are offered to the toppers of all the Board/University. Recently, Galgotias University has been ranked 12 by TIMES for its BBA course. As per the recent placement records, the average package was recorded at 5.4 LPA. Overall, the university can be a decent choice to pursue BBA course."
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission in Galgotias University for MBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Admission to MBA at Galgotias University is based on scores obtained in various national-level entrance exams. Candidates seeking admission to this course must qualify for any one of the following entrance exams: MAT CAT NMAT CMAT CUET-PG Further, a counselling process will be conducted at the university for the final seat allotment. Candidates whose names appeared on the merit list have to pay a certain amount of fee to lock their seat. In case, the seats get filled or students are found non-eligible for the course, the admission counsellor will interview the candidate for the second attempt. However, this information is based on unofficial sources. Candidates are advised to get clarity from the official website or the admission office of Galgotias University."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission in Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, students can get direct admission at Galgotias University. Candidates can easily enroll for direct admission to courses such as BCA, BCA, BDes, BSc, etc. Admission to these courses is done based on candidates merit obtained in the last qualifying exam of Class 12. The final selection carries out with document verification process and fee payment that leads to the final seat allotment. However, the university also grants admission to other courses such as MBA, BTech, and others based on national-level entrance exams."
                }
            },
            {
                "@type": "Question",
                "name": "Who is eligible for BBA at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates seeking for admission to Galgotias University BBA course must pass Class 12 with minimum 50 to 60% aggregate in the subjects taken in Class 12. Aspirants must hold all the documents as the their education proof. However, the eligibility may vary as per the type of BBA specialisation one chooses. Refer to the following table for a detailed specialisation-wise eligibility criteria for Galgotias University BBA course: Specialisation Eligibility Criteria BBA Financial Investment Analysis A pass in Class 12 or equivalent qualification in the Arts/ Commerce / Science stream with at least 60% aggregate from a recognised educational Board. For migration from other universities: BBA FIA first-year with a minimum 60% aggregate or equivalent Class 12 with at least 60% aggregate or above BBA Tourism & Travel Class 12 or equivalent with a minimum of 50% aggregate For migration from other universities: BBA Tourism & Travel first-year with a minimum of 60% aggregate or equivalent Class 12 with at least 50% aggregate or above For all other specialisations Class 12 with at least 60% aggregate or above in best of four subjects For migration from other universities: BBA first-year with a minimum of 60% aggregate or 6.0 CGPA on a 10 point scale Class 12 with at least 60% aggregate or above in the best four relevant subjects"
                }
            },
            {
                "@type": "Question",
                "name": "What is eligibility criteria for BSc at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates willing to take admission to the BSc programme at Galgotias University must fulfil the eligibility and selection criteria mentioned below: Candidates must have passed class 12 in the Science stream with a minimum of 50% aggregate. Candidates based on their marks in class 12 will be selected for further admission process and will be required to report to the admission cell at Galgotias University for document verification and fee payment leading to final seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission to BTech at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University offers admission to BTech programme based on merit or entrance exam scores. The university considers the Class 12 merit of the aspirants for BTech course. Aspirants with a valid score in JEE Main or CUET are also eligible for BTech admission. Besides, candidates must also complete Class 12 with a minimum of 60% aggregate in Physics, Chemistry & Mathematics for BTech course."
                }
            },
            {
                "@type": "Question",
                "name": "Is there any scholarship in Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University provides a total of five scholarships to its meritorious students and students carving their marks in sports, performing arts, and literature. Candidates can get merit scholarships based on academic performance in examinations prescribed by the University i.e. Class 12 or Graduation, Rank/Score in All India/State Level Entrance/ Aptitude Test and candidates possessing exemplary skills in sports, performing arts or literary skills. Similarly, for scholarships from Sports quota, candidates can get Galgotias University admission in two ways Direct Admission without Sports Trials and Admission with Sports Trials. Additionally, the toppers of all the Board/Universities get a 100% tuition fee waiver and the students securing up to 4000th rank in the JEE Examination - a 50% tuition fee waiver. Candidates can click here for more details regarding Galgotias University scholarships."
                }
            },
            {
                "@type": "Question",
                "name": "Is MBA available at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotia University offers a two-year full-time course of MBA in Dual Specialisations. Also, candidates can pursue MBA in further nine specialisations. Candidates willing to take admission to the MBA programme at Galgotias University must fulfil the following course requirements: Candidates must possess a bachelor’s degree in any discipline with a minimum of 50-55% aggregate. Candidates based on their graduation marks will be selected for further admission rounds. Selected candidates will have to report to the admission cell at Galgotias University for document verification and fee payment."
                }
            },
            {
                "@type": "Question",
                "name": "Which college provides a better median salary for MBA/PGDM: Greater Noida Institute of Technology or Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The median salary package offered to the students after finishing MBA/PGDM from Greater Noida Institute of Technology is INR 700,000. While, the Median package offered by Galgotias University after completion of MBA/PGDM is INR 348,456. Basis these stats, Greater Noida Institute of Technology is better option compared to Galgotias University on the Median salary parameter."
                }
            },
            {
                "@type": "Question",
                "name": "Is BSc available at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotias University offers a three-year full-time BSc programme across ten specialisations and multiple sub-specialisations. Candidates willing to take admission to the BSc programme at Galgotias University must have passed class 12 in the Science stream with a minimum of 50% aggregate. Candidates based on their class 12 marks will be selected for further admission rounds and will have to report to the admission cell at Galgotias University for document verification and tuition fee payment after which the seat in the opted programme will be locked for the candidate."
                }
            },
            {
                "@type": "Question",
                "name": "Is Galgotias University good for placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The Galgotia University Greater Noida offers good annual placements for various courses like BTech, MBA, <a href=\"https://www.shiksha.com/university/galgotias-university-greater-noida-37105/courses/mca-bc\">MCA</a>, etc. In 2023, over 580 recruiters offered job opportunities. The highest package and average package stood at INR 1.50 crore per annum and INR 5.25 LPA, respectively. Additionally, 32% of offers were multiple job opportunities. The top recruiters of Galgotias University placements 2023 included Microsoft, Amazon, American Express, Commvault, and many other renowned companies."
                }
            },
            {
                "@type": "Question",
                "name": "How good is Galgotias University for MBA placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "MBA is one of the popular courses of Galgotias University. When it comes to placements, the University offers decent placements annually. The course-wise placement details are yet be released for the batch 2023. However, as per the overall statistics, the highest package and average package offered during Galgotias University placements 2023 were INR 1.50 crore per annum and INR 5.25 LPA, respectively. More than 8,500 job offers were received, including 32% multiple offers."
                }
            },
            {
                "@type": "Question",
                "name": "How are the placements for BBA at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University has released the placement statistics 2023 for various UG courses. Over 8,500 job offers to the 2023 batch. Check the following table to get the top highlights of the Galgotias University placements 2023: Particulars Placement Statistics (2023) Total offers 8,500+ Placement rate 98% Total recruiters 850+ Multiple offers 32% Average package INR 5.40 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "Is it worth pursuing BPT at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "{Source: BPT students & alumni} Based on student reviews and feedback, here's a summary of the key points: Positive Points: * Faculty members are helpful, qualified, and knowledgeable. * Course curriculum is relevant and makes students industry-ready. * Opportunities for internships and placements exist, although limited. * Facilities such as libraries, labs, and OPDs are available. * Campus infrastructure is well-maintained, with amenities like Wi-Fi, gyms, and sports facilities. * Affordable tuition fees, with a course cost of INR60,000. Negative Points: * Limited patient exposure during the course. * No guaranteed placements, and students may need to secure internships independently. * Some faculty members are reportedly not cooperating or knowledgeable. * Attendance requirements can limit flexibility. * Some students found the environment unhygienic or unsatisfactory. Overall, while Galgotias University seems to offer a solid foundation in physiotherapy, students may face challenges securing placements and gaining hands-on experience. Considering the relatively low course fee, it could be a viable option for those interested in pursuing a career in physiotherapy. However, potential students should weigh these factors carefully before making a decision."
                }
            },
            {
                "@type": "Question",
                "name": "Which college is more affordable for B.A. among IIMT University and Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIMT University and Galgotias University both are renowned universities for B.A. However, in terms of affordability, IIMT University is a better option since the total tuition fee for IIMT University is INR 30,000 - INR 180,000 and the total tuition fee for B.A. at Galgotias University is INR 138,000 - INR 231,000. In the total fees that students generally end up paying the university or the college, various other components are also included, such as the exam fee, application fee, lab and other charges."
                }
            },
            {
                "@type": "Question",
                "name": "Are Galgotias University courses UGC recognised?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Galgotias University courses are UGC recognised. Degrees awarded by Galgotias University are approved by the UGC under its Section 22. Candidates applying for admission in Galgotias University courses will get a valid degree from the institute which they can use in their future endeavours. The University has UGC recognition under its Section 2 (f). Candidates can have a look at the university or UGC website for any doubts regarding legitimacy of degrees of courses at galgotias university."
                }
            },
            {
                "@type": "Question",
                "name": "What is the eligibility criteria for admission to MBA at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For admission to a two-year PG course of MBA at Galgotias University, candidates are required to fulfil the minimum eligibility criteria as per the course requirements. Candidates who are willing to get admission to MBA course at Galgotias University must pass either three or four year UG-level programme in the respective subject from a recognised university. Futher, they must obtained a minimum of 50 to 55% aggregate in their final graduation level examination. For detailed Galgotias University MBA admission process, click here."
                }
            },
            {
                "@type": "Question",
                "name": "Is Galgotias University good for B.A. LL.B. (Hons)?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "{Source: B.A. LL.B. (Hons) students & alumni} Based on the reviews and feedback from students and alumni, here's what you need to know: Pros: * Good infrastructure and campus facilities, including a modern library, moot court, and sports amenities. * Helpful and knowledgeable faculty members who are willing to assist students. * Relevant course curriculum that prepares students for the industry. * Opportunities for internships and practical training. * A wide range of extra-curricular activities and events organized by the university. Cons: * Placement record is not impressive, with fewer job opportunities available. * Limited on-campus placements, and students often have to find internships themselves. * Quality of hostel food is not consistently good. * Traffic and transportation issues within the campus. Overall Assessment: While Galgotias University has its strengths in terms of infrastructure, faculty, and curriculum, the limited placement opportunities and traffic issues within the campus may be areas of concern for some students. However, with careful planning and self-motivation, students can still achieve their goals despite these challenges."
                }
            },
            {
                "@type": "Question",
                "name": "What are the CUET PG 2025 exam dates?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "CUET PG 2025 Exam Dates has been revised by NTA on February 26, 2025. Earlier, the exam was scheduled to be held from March 13, 2025 to March 31, 2025. The new press release by NTA has mentioned the new CUET PG 2025 exam dates which are- March 13, 2025 to April 1, 2025. The exam officials has also released the CUET PG 2025 exam date sheet of 157 subjects for which the exam will be conducted in 43 shifts."
                }
            },
            {
                "@type": "Question",
                "name": "Is After 10th Diploma at Galgotias University a good choice?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "{Source: After 10th Diploma students & alumni} After 10th Diploma at Galgotias University: A Good Choice? Galgotias University's Diploma programme in various streams has received mixed reviews from students and alumni. While some have praised the university's infrastructure, faculty, and internship opportunities, others have expressed concerns about the limited career prospects and placement offers. Here are some key points to consider: Placement Records * Around 80-85% of students have been placed in top companies like TCS, Wipro, and Tejas. * The highest salary package offered was 4.5 LPA, while the average salary was 3 LPA. * Some students reported difficulty finding placements due to the Diploma being viewed as inferior to Bachelor's degrees. Faculty and Curriculum * Most students praised the faculty, describing them as \"helpful,\" \"qualified,\" and \"knowledgeable.\" * The curriculum was considered relevant and industry-ready by many students. Infrastructure and Facilities * The university's infrastructure, including laboratories, libraries, and hostels, was generally praised by students. * However, some students noted issues with hostel quality and availability of medical facilities. Internship Opportunities * Approximately 85-90% of students have taken internships in companies like Wipro and TCS. * Internships were reported to be beneficial in gaining industry exposure and building networks. Overall Assessment While Galgotias University's Diploma programme shows promise in terms of infrastructure, faculty, and internship opportunities, the limited career prospects and placement records may deter some students from considering this option. Ultimately, the decision to pursue a Diploma at Galgotias University depends on individual circumstances and goals. Recommendation: We recommend exploring the university's website, reviewing the curriculum, and contacting current students or alumni to gather more information before making a decision. Additionally, considering alternative options, such as Bachelor's programs, may be worth exploring for those seeking broader career prospects."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get a government job through a Galgotias University degree?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University courses are valid to secure a government job as the university is approved by NCTE, UGC recognised and the university is approved as a state private university by the Uttar Pradesh Government. Therefore, degrees given by the university are valid to when applying for government jobs in India. Candidates can check the university website for any doubts regarding the legitimacy of courses at Galgotias University."
                }
            },
            {
                "@type": "Question",
                "name": "Which MBA specialisations does Galgotias University offer?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University MBA courses are offered for a duration of either one or two year. The university offers MBA course in total of nine specialisations, along with a separate MBA (Dual Specialisation) course. Find below the duration-wise MBA specialisations offered at Galgotias University: MBA Specialisation (One-year) MBA Specialisation (Two-year) MBA (Dual Specialisation) MBA (Dual Specialisation) Aviation Management Aviation Management Financial Management Logistics & Supply Chain Management Logistics & Supply Chain Management Financial Management Tourism & Travel Management Tourism & Travel Management"
                }
            },
            {
                "@type": "Question",
                "name": "Is DPharma good at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, DPharm at Galgotias University is a four-year undergraduate programme that introduces students to the essential concepts of pharmaceutical sciences. Galgotias University provides lab facilities for its DPharm students. The campus has well-equipped labs for pharmaceutical chemistry, biotechnology, etc., and a fully-fledged library. The university also has A+ NAAC accredition which makes it a worthwhile institution."
                }
            },
            {
                "@type": "Question",
                "name": "Can I do a BPharm at Galgotias University after completing my DPharm?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, candidates can apply for admission at Galgotias University BPharm programme after completing their DPharm education. The university offers lateral admission into the programme, BPharma (LE) is a three-year course offered at the UG level. The eligibility for the BPharma (LE) programme is at least 60% aggregate or 6.0 CGPA in the first year in BPharm or their Diploma programme. If candidates are eligible for the programme they can apply for admission in lateral entry."
                }
            },
            {
                "@type": "Question",
                "name": "Is CUET compulsory for Galgotias University BCom?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, as admission into the BCom programme at Galgotias University take place through the CUET-UG exam. The entrance exams are necessary. If candidates want to take admission in the Galgotias University BCom programme they should appear for the CUET-UG exam as the university does not consider or conduct any other exam for BCom admission in the university. Also, candidates have to make sure they get a minimum of 50% aggregate score in their Class 12 exams to be eligible for admission."
                }
            },
            {
                "@type": "Question",
                "name": "Is Galgotias University BBA admission open?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The Galgotias University admission process starts with the release of application forms. The admission process for the year 2023 has been completed. Candidates must visit the official website to apply for BBA once the application window gets open for the admission year 2024. Aspirants are advised either to keep checking the official website or the admission office of the university."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fees of Galgotias University for MCA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University offers MCA (General) and MCA industry-oriented programmes. The tuition fee for both courses ranges between INR 92,000 - INR 1.84 lakh. Apart from the tuition fee, candidates may also have to pay for the Security Deposit (Refundable) and Hotel Fees (if applicable). However, this information is sourced from official website/ sanctioning body and is subject to change. For a detailed Galgotias University MCA fee structure, candidates are advised to visit the official website."
                }
            },
            {
                "@type": "Question",
                "name": "Is Galgotias University expensive?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University offers various Undergraduate, Postgraduate and PhD programmes under 19 departments. Galgotias University courses include BTech, MTech, BCom, BBA, BSc, BCA, MSc, MBA, MCA, BEd, LLB (Hons), BPharm, etc. The course fee for all the programmes varies. Tabulated below is the list of a few popular programmes along with their total tuition fee: Courses Total Tuition Fees MBA INR 90,000 -INR 4.8 lakh BTech INR 1.4 lakh - INR 6 lakh BSc INR 1.4 lakh - INR 5.5 lakh BCA INR 2.2 lakh - INR 3.9 lakh BBA INR 2.1 lakh - INR 4.8 lakh Students can apply for various scholarships offered by Galgotias University to reduce the total tuition fee. Candidates can get merit scholarships based on academic performance in examinations prescribed by the university, i.e., Class 12 or Graduation, rank or score in the All India/State Level Entrance/Aptitude Test, and candidates possessing exemplary skills in sports, performing arts, or literary skills."
                }
            },
            {
                "@type": "Question",
                "name": "Is BPharm costly at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The BPharm programme at Galgotias University has a total tuition fee of INR 5.2 Lacs which is to be paid over four years. Candidates will have to pay an average tuition fee of INR 1.3 Lacs every year during the course of the programme. The tuition fee might be expensive for some people, therefore candidates can use the scholarships provided by the university to get aid in paying the tuition fee."
                }
            },
            {
                "@type": "Question",
                "name": "What is the total fee of BPharma programme offered by Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total fee of BPharma is INR 5.26 lakh."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fee structure of BBA at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Galgotias University's fee structure for a BBA course is inclusive of various components. As per the official website, Galgotias University BBA fees for a three-year course is INR 2.85 lakh. Whereas the tuition fee for a four-year BBA course ranges between INR 3.8 Lacs to INR 4.2 lakh. Apart from the Tuition Fees, candidates also have to pay for the Security Deposit (Refundable) and Application Fees. Students who apply for accommodation have to pay separate charges. For a detailed Galgotias University MBA fee structure, candidates are advised to visit the official website."
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/greater-noida",
                    "name": "Colleges in Greater Noida"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105",
                    "name": "Galgotias University Greater Noida"
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/courses",
                    "name": "Courses"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "Galgotias University Courses & Fees 2025 : BTech, BBA, BCA, MBBS, BCom & more",
        "description": "Check 10  courses and their fee details at Galgotias University Greater Noida. Find details of all  UG & PG degree, diploma and certification programs offered by Galgotias University Greater Noida along with course Duration, Reviews, Eligibility & Apply Dates",
        "dateModified": "2025-01-02T16:58:00+05:30",
        "datePublished": "2024-10-04T15:51:45+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/courses",
            "@type": "WebPage",
            "name": "Galgotias University"
        },
        "author": {
            "@type": "Person",
            "name": "PoojaSharma",
            "url": "https://www.shiksha.com/author/pooja278128"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1569477243php7w52lR.jpg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "ItemList",
        "name": "Galgotias University Courses & Fees 2025 : BTech, BBA, BCA, MBBS, BCom & more",
        "description": "Check 10  courses and their fee details at Galgotias University Greater Noida. Find details of all  UG & PG degree, diploma and certification programs offered by Galgotias University Greater Noida along with course Duration, Reviews, Eligibility & Apply Dates",
        "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/courses",
        "numberOfItems": "20",
        "itemListElement": [
            {
                "@type": "ListItem",
                "name": "MBA in Dual Specialization at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-mba-in-dual-specialization-179700",
                "position": 1
            },
            {
                "@type": "ListItem",
                "name": "BBA  in Tourism and Travel at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-bba-in-tourism-and-travel-309491",
                "position": 2
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Computer Science Engineering (Business Analytics and Optimization) at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-tech-in-computer-science-engineering-business-analytics-and-optimization-188367",
                "position": 3
            },
            {
                "@type": "ListItem",
                "name": "Discontinued (Aug2023)- M.Tech. in Computer Science Engineering at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-discontinued-aug2023-m-tech-in-computer-science-engineering-278374",
                "position": 4
            },
            {
                "@type": "ListItem",
                "name": "B.A. LL.B. (Hons.) at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-a-ll-b-hons-179604",
                "position": 5
            },
            {
                "@type": "ListItem",
                "name": "BBA LL.B. (Hons.) at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-bba-ll-b-hons-179610",
                "position": 6
            },
            {
                "@type": "ListItem",
                "name": "LL.B. (Hons.) at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-ll-b-hons-179597",
                "position": 7
            },
            {
                "@type": "ListItem",
                "name": "Master of Law (LLM) in Constitutional law and Governance at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-master-of-law-llm-in-constitutional-law-and-governance-179738",
                "position": 8
            },
            {
                "@type": "ListItem",
                "name": "BBA in Banking, Financial Services and Insurance at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-bba-in-banking-financial-services-and-insurance-179536",
                "position": 9
            },
            {
                "@type": "ListItem",
                "name": "M.Tech. in Computer Science Engineering (Artificial Intelligence and Machine Learning) at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-m-tech-in-computer-science-engineering-artificial-intelligence-and-machine-learning-278373",
                "position": 10
            },
            {
                "@type": "ListItem",
                "name": "Bachelor of Computer Application (BCA) at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-bachelor-of-computer-application-bca-179519",
                "position": 11
            },
            {
                "@type": "ListItem",
                "name": "Integrated BBA + MBA at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-integrated-bba-mba-179546",
                "position": 12
            },
            {
                "@type": "ListItem",
                "name": "B.Com. (Hons.) in International Accounting and Finance at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-com-hons-in-international-accounting-and-finance-179553",
                "position": 13
            },
            {
                "@type": "ListItem",
                "name": "B.A. (Hons.) in Economics at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-a-hons-in-economics-179557",
                "position": 14
            },
            {
                "@type": "ListItem",
                "name": "B.A. (Hons.) in English at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-a-hons-in-english-179570",
                "position": 15
            },
            {
                "@type": "ListItem",
                "name": "B.A. (Hons.) in Applied Psychology at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-a-hons-in-applied-psychology-179574",
                "position": 16
            },
            {
                "@type": "ListItem",
                "name": "B.A. (Hons.) in Political Science at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-a-hons-in-political-science-179578",
                "position": 17
            },
            {
                "@type": "ListItem",
                "name": "B.A. (Hons.) in Sociology at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-a-hons-in-sociology-179579",
                "position": 18
            },
            {
                "@type": "ListItem",
                "name": "Discontinued (Aug 2021 ) - Bachelor of Library and Information Science at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-discontinued-aug-2021-bachelor-of-library-and-information-science-179588",
                "position": 19
            },
            {
                "@type": "ListItem",
                "name": "B.Sc. (Hons.) in Computer Science at Galgotias University Greater Noida",
                "url": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/course-b-sc-hons-in-computer-science-179589",
                "position": 20
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]