[
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "How good is Galgotias University for MBA placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "MBA is one of the popular courses of Galgotias University. When it comes to placements, the University offers decent placements annually. The course-wise placement details are yet be released for the batch 2023. However, as per the overall statistics, the highest package and average package offered during Galgotias University placements 2023 were INR 1.50 crore per annum and INR 5.25 LPA, respectively. More than 8,500 job offers were received, including 32% multiple offers."
                }
            },
            {
                "@type": "Question",
                "name": "What was the placement rate recorded during Galgotias University placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The overall placement percentage for 2023 has not been released. As per the latest report, 32% of multiple offers were made during Galgotias University placements 2023. The same is presented below: Particulars Placement Statistics (2023) Multiple offers 32%"
                }
            },
            {
                "@type": "Question",
                "name": "What is the placement package at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The following table represents the Galgotias University placement package for the 2023 drive: Particulars Placement Statistics (2023) the highest package INR 1.50 crore per annum Average package INR 5.25 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "Which company selected the highest number of students during Galgotias University placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "As per the official report, Cognizant emerged as the top recruiting company during 2023 placements with 248 students placed. The second in the sequence was Accenture with 155 students placed. The table below represents the top five recruiters along with the number of students placed in them during Galgotias University placements 2023: Company No. of Students Placed (2023) Cognizant 248 Accenture 155 Mindtree 120 ICICI Securities 96 TCS 74"
                }
            },
            {
                "@type": "Question",
                "name": "Where do Galgotias University alumni work?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "According to unofficial sources, Galgotias University alumni are working in various sectors such as Engineering, Operations, Business Development, Marketing, Sales and more. Of all the sectors, 33% of alumni work in the Engineering sector. Additionally, 14% and 12% of alumni work in the Business Development and Information Technology sectors, respectively. For a detailed analysis of the sector-wise distribution of alumni, see the below pie chart: NOTE: The sectors involved in the ‘Others’ category are Operations, Sales, Administrative, Research, Human Resources, Marketing, Support, Consulting, and Finance."
                }
            },
            {
                "@type": "Question",
                "name": "Who were the top recruiters at Galgotias University placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The University attracted over 580 recruiters for its 2023 placement session who offered a variety of job roles to the students across sectors such as BFSI, IT, Education, FMCG, Consulting, and E-Commerce, etc. The top recruiters of Galgotias University placements 2023 included Microsoft, Amazon, American Express, Commvault, Zscaler, Capillary Technologies, Deloitte, KPMG, EY, Hero Corp, etc. These recruiters placed students in various sectors and offered new-age job profiles."
                }
            },
            {
                "@type": "Question",
                "name": "How many companies participated in recent placements at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "During 2023 placements, 580 companies offered jobs to eligible students. Earlier, 846 companies offered jobs during the 2022 placements. The table below depicts the Galgotias University placement trends in terms of the number of companies: Particulars Placement Statistics (2021) Placement Statistics (2022) Placement Statistics (2023) No. of companies 758 846 580"
                }
            },
            {
                "@type": "Question",
                "name": "Is Galgotias University good for placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The Galgotia University Greater Noida offers good annual placements for various courses like BTech, MBA, <a href=\"https://www.shiksha.com/university/galgotias-university-greater-noida-37105/courses/mca-bc\">MCA</a>, etc. In 2023, over 580 recruiters offered job opportunities. The highest package and average package stood at INR 1.50 crore per annum and INR 5.25 LPA, respectively. Additionally, 32% of offers were multiple job opportunities. The top recruiters of Galgotias University placements 2023 included Microsoft, Amazon, American Express, Commvault, and many other renowned companies."
                }
            },
            {
                "@type": "Question",
                "name": "What was the highest package offered during Galgotias University placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "During 2023 placements, the highest package offered was INR 1.50 crore per annum. The table below depicts Galgotias University highest package for reference: Particulars Placement Statistics (2023) Highest package INR 1.50 crore per annum"
                }
            },
            {
                "@type": "Question",
                "name": "How many companies participated in Galgotias University placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "More than 580 companies visited the University campus for hiring the 2023 passing out batch. Tabulated below are the exact numbers for a better understanding of Galgotias University placements: Particulars Placement Statistics (2023) No. of companies 580"
                }
            },
            {
                "@type": "Question",
                "name": "How many offers were made during Galgotias University placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "During 2023 placements, the participating recruiters presented over 8,500 job offers to the 2023 passing-out batch. The table below represents the number of offers made during Galgotias University placements 2023: Particulars Placement Statistics (2023) No. of offers 8,500+"
                }
            },
            {
                "@type": "Question",
                "name": "What is the average package offered at Galgotias University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The Galgotias University average package for the academic year 2022-23 stood at INR 5.25 LPA. The following table depicts the same: Particulars Placement Statistics (2023) Average package INR 5.25 LPA"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/greater-noida",
                    "name": "Colleges in Greater Noida"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105",
                    "name": "Galgotias University Greater Noida"
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/placement",
                    "name": "placement"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "Galgotias University Placements 2024: Highest Package, Average Package, Top Companies",
        "description": "Check Galgotias University, Greater Noida Placement details, Average & Highest salary package, Top Companies, Percentage of batch placed and latest placement trends for various courses. Download Brochures & Placement details of Galgotias University Greater Noida.",
        "dateModified": "2024-11-25T15:38:00+05:30",
        "datePublished": "2014-08-06T10:38:11+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/galgotias-university-greater-noida-37105/placement",
            "@type": "WebPage",
            "name": "Galgotias University"
        },
        "author": {
            "@type": "Person",
            "name": "AarushiKalra",
            "url": "https://www.shiksha.com/author/Aarushi153743"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1569477243php7w52lR.jpg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]