[
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "Can I get DTU with 80 percentile in JEE Main via JAC Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Usually, the cutoff for DTU stays around 90, even for the reserved categories. Therefore, getting into B.Tech courses at DTU is difficult with a JEE Main percentile score of 90 or below. The cutoff also goes high and low every year, depending on the following factors: Number of aspirants registered, The difficulty level of the exam, Total number of seats available, total number of applications received for a particular program, and the category under which admission is sought. Therefore, it is very difficult to predict the exact cutoff and give an exact answer to this question."
                }
            },
            {
                "@type": "Question",
                "name": "Do I need 75% to get into DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For admission to most of the undergraduate and postgraduate courses offered at Delhi Technological University, students are required to score 50% to 60% minimum aggregate in their last qualifying degree or course to be eligible. A course-wise list of eligibility criteria for DTU admission is mentioned in the following table: Course Name Eligibility Criteria BTech Class 12 with 60% BDes A pass in Class 12 BBA Class 12 with 50% MSc Class 12 with 50% in Economics MTech Relevant UG degree with at least 60% MDes 4-year UG with 55% E-MBA Any UG degree with 60% E-MBA UG degree with 50% MSc Relevant BSc/ UG degree with 55% E-MBA UG degree with 50% PhD Relevant PG degree with 55% Hence, as per the table, it can be concluded that while all 75% scorers will be preferred at DTU, the minimum requirement to get admission and be eligible for DTU admission is comparatively low."
                }
            },
            {
                "@type": "Question",
                "name": "Is DTU good for M.Tech CSE?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "In 2022, DTU got ranked at position 35 for the Engineering category. Hence, it is considered a good option for MTech. Not just this, as per the verified students’ reviews on Shiksha, the institute offers all the necessary amenities to the students with respect to well-equipped laboratories with all the necessary instruments, computers and software according to students' needs, a spacious library with all kinds of books to enhance the IT and technology-related knowledge of students. However, the choice of branch depends on the requirement and discretion of the students. For more reviews on DTU for MTech, click here."
                }
            },
            {
                "@type": "Question",
                "name": "Is there a separate entrance exam to get admission in DTU for B.Tech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For BTech admission, DTU accepts JEE Main followed by JAC counselling and the entire admission process is conducted via Joint Admission Counselling (JAC) Delhi. To be eligible, candidates must fulfil the below eligibility criteria: Delhi Region candidates (85% of seats): Aspirants passing the qualifying exam from a recognised school/ college/ institute located within the National Capital Territory (NCT) of Delhi will be considered for the Delhi Region only Outside Delhi Region candidates (15% of seats): Aspirants passing the qualifying examination from a recognised school/ college/ institute located outside the National Capital Territory of Delhi will be considered for Outside Delhi Region only."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get into DTU without giving JEE?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, candidates cannot get admission to DTU without appearing for JEE Main as the DTU BTech counselling is done through JAC Delhi. The basic criteria for admission to BTech is appearing for JEE Mains. To get into DTU, candidates must score decent marks or at least around 220 or above marks in JEE Mains. The only way to get into DTU without appearing for JEE Main is by taking a lateral entry admission to BTech second year. In order to do this, candidates must complete a Polytechnic course of two years and then appear for an entrance exam (not JEE Main but this exam will give you entry in DTU's second year."
                }
            },
            {
                "@type": "Question",
                "name": "What is the opening and closing rank for B.Tech. in Computer Science and Engineering at Delhi Technological University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The opening and closing rank depends on the category and quota of candidates. For General category under all India quota, opening rank was 2109 and closing rank was 4008. Cut off are differant when it comes to other categories or female candidates and even domicile of home state. Admission to B.Tech. in Computer Science and Engineering in DTU - Delhi Technological University is based on the scores obtained in the entrance exam JEE. Applicants are advised to confirm what category are they applying while checking for cut offs."
                }
            },
            {
                "@type": "Question",
                "name": "Does DTU accept Class 12 marks for admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Delhi Technological University accepts only Class 12 scores for admission to the BBA and BA (Economics) courses offered by it at the undergraduate levels. While admission to all the other UG and PG courses is subject to national-level entrance exams and couselling process, there courses offer direct merit-based admission to the students. Check DTU eligibility criteria for all UG courses in the below table: Course Name Eligibility & Selection Criteria BTech Eligibility: Class 12 with 60% Selection Criteria: JEE Main, JAC Delhi, DASA UG BDes Eligibility: A pass in Class 12 Selection Criteria: UCEED BBA Eligibility: Class 12 with 50% Selection Criteria: Merit list is drawn based on scores obtained in the best of 4 subjects in Class 12 BA (Hons) in Economics Eligibility: Class 12 with 50% Selection Criteria: Merit list is drawn based on scores obtained in the best of 4 subjects in Class 12"
                }
            },
            {
                "@type": "Question",
                "name": "Can I take admission in DTU M.Tech without GATE?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Delhi Technological University also offers admission to candidates also who have AMIE/ AMIS. AMIICHE/ AMIIM/ Grad IETE or those who possess a BSc/ Diploma in Engineering degree. Such candidates are not required to have a GATE score for admission to DTU. For more details on this subject, students are advised to reach out to the admission office. Know more about DTU's M.Tech programme."
                }
            },
            {
                "@type": "Question",
                "name": "How can I apply for BTech at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The application process for all the courses offered via DTU is completely online. Candidates seeking admission to BTech are required to apply via JAC Delhi website, i.e. jacdelhi.nic.in. For admission 2023, counselling registration via JAC Delhi was started on May 20. JAC registration is a two-step online process where students have to fill out the online application form and then make the payment of the application fee. Students should note that JAC Delhi allows additional registrations and changes in the course preference before every round. Read the detailed BTech application process here."
                }
            },
            {
                "@type": "Question",
                "name": "Is DTU as good as an IIT?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "DTU's BTech in Civil Engineering course has been rated 4.2/5 by 95 Shiksha verified students, while the same course at IIT Delhi has been rated 4.6/5 by 41 students at Shiksha. Also, as per the NIRF 2023 Rankings, Delhi Technological University has been ranked 29 under the 'Engineering' category, however, there are many IITs that are ranked before DTU in the same category. But, despite that, DTU competes against the top-notch NITs and second-phase IITs in streams such as Computer Science Engineering, Mechanical Engineering, and Mathematics and Computing. Hence, it is safe to say that DTU is as good as a second-phase IIT or an NIT."
                }
            },
            {
                "@type": "Question",
                "name": "What is the selection criteria for admission to the engineering programs at Delhi Technological University (DTU)?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Imagine this - You're a high school student with a passion for engineering. You're browsing through the website of Delhi Technological University (DTU), one of the top engineering universities in India, and you stumble upon the admission criteria for their engineering programs. The admission requirements seem daunting, but don't worry, I'm here to guide you through it all! First things first, to be eligible for admission to DTU's undergraduate engineering programs, you need to take the Joint Entrance Examination (JEE) Main and JEE Advanced. These exams test your knowledge in subjects like Physics, Chemistry, and Mathematics, and are a critical component of the selection process. But wait, there's more! If you're interested in pursuing a Master of Technology (M.Tech) degree, you need to take the Graduate Aptitude Test in Engineering (GATE) and score well. This exam tests your understanding of technical subjects like engineering, Science, and mathematics. And for those of you looking to pursue a Doctor of Philosophy (Ph.D. ) degree, DTU conducts its entrance examination. The exam is designed to test your aptitude, research skills, and domain knowledge. So, whether you're a high school student aspiring to be an engineer, or a graduate looking to further your education, DTU has a programme for you. Just make sure to meet the admission criteria, and you're on your way to an exciting and rewarding career in engineering!"
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission to M.Tech at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "MTech programme at DTU is available in both part-time and full-time modes. Admission to the M.Tech course is subject to a merit list prepared on the basis of GATE scores across all the specialisations. However, for part-time mode programmes, admission is subject to a merit list prepared on the basis of the last qualifying marks. Interested candidates can apply online on the official website. To be eligible for this course, students have to meet the below requirements: A pass in relevant UG degree with at least 60% aggregate Those in the final year of their UG degree can also apply Those with AMIE/ AMIS/ AMIICHE/ AMIIM/ Grad IETE or those who possess a BSc/ Diploma in Engineering are also eligible"
                }
            },
            {
                "@type": "Question",
                "name": "How much do I need to score in JEE Mains to get admission in DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The higher (better) the score, the higher are chances of admission. Students from General category must have JEE Mains rank above 10,000 to have high chances. In the last round of JAC Delhi counselling students with a rank ranging between 4810 and 24274 were able to score admission. However, the higher the rank, the less competitive specialisation was offered. This rank range mentioned is for Computer Engineering and Environmental Engineering, respectively."
                }
            },
            {
                "@type": "Question",
                "name": "How to register for B.Tech in DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "DTU offers B.Tech programme to regular, working professionals, and lateral entry candidates. Selection to the regular mode of the programme will be done on the basis of JEE Main rank and JAC Delhi counselling. Candidates who have the JEE Main 2025 AIR can register for JAC counselling for admission to the B.Tech courses offered at DTU. Note that there will be no other mode of admission in DTU B.Tech admission. JAC Delhi is a single online counselling window for admission to B.Tech courses offered by DTU. Selection to courses such as B.Tech, M.Tech, and B. Des is made on the basis of national-level exam scores. For MBA, M.Des M.Sc. And Ph.D. DTU conducts its own entrance exams. DTU BBA admissions are made on the basis of Class 12 merits."
                }
            },
            {
                "@type": "Question",
                "name": "Which college is better to pursue BTech in Mechanical Engineering among DTU and NSIT?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "As confirmed by a final-year Mechanical undergraduate at DTU-Professors, academics, labs and everything else may be comparable but you aren't going to study all the time. So, when it comes to activities outside the classroom, DTU trumps NSIT easily. Be it curricular fests, sports activities, cultural societies, lenient environment, better infrastructure or even campus as a whole, DTU is far better than NSIT. And taking into consideration the reputation and demand of Mechanical, DTU's Mechanical Engineering stream trumps NSIT's. Even in the field of placements, companies prefer DTU over NSIT for the recruitment of Mechanical Engineering. NSIT needs time to set up its brand when it comes to Mechanicals. '"
                }
            },
            {
                "@type": "Question",
                "name": "How can I apply for MBA at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates seeking admission to MBA at DTU can are required to apply via CMAC or via DTU's official website After registering and filling out the online application, students are also required to pay the applicable application fee which ranges between INR 750 and INR 1,500 for different courses across different categories. A category-wise breakup of the application fee is as follows: Course Name Registration fee MBA (via DSM/ USME) INR 1,500 (for all categories) MBA (Business Analytics) INR 1,500 for General and OBC | INR 750 for SC/ ST/ PwD MBA (Family Business and Entrepreneurship) INR 1,500 for General and OBC | INR 750 for SC/ ST/ PwD MBA (Entrepreneurship, Innovation and Venture Development) INR 1,500 for General and OBC | INR 750 for SC/ ST/ PwD"
                }
            },
            {
                "@type": "Question",
                "name": "How does the DTU BTech in Electrical Engineering differ from other colleges?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The Electrical Engineering programme at Delhi Technological University (DTU) is designed to provide students with a comprehensive understanding of the principles and applications of electrical engineering. Here are some ways in which the Electrical Engineering programme at DTU differs from other colleges: Curriculum: The curriculum of the Electrical Engineering programme at DTU is regularly updated to keep up with the latest developments in the field. The programme includes courses in power systems, electrical machines, control systems, electronics, and communication. Faculty: The faculty members of the Electrical Engineering department at DTU are highly experienced and have expertise in various areas of electrical engineering. They regularly engage in research and innovation, which benefits the students. Research Opportunities: DTU provides ample opportunities for students to engage in research through various initiatives such as the Centre for Applied Research in Electronics (CARE) and the Centre for Energy Studies (CES). Students can also participate in various research projects and internships in collaboration with industry partners. Industry Partnerships: DTU has strong partnerships with various industries, which provides students with opportunities to work on real-world projects and gain practical experience. Infrastructure: The Electrical Engineering department at DTU is well-equipped with state-of-the-art laboratories and facilities. Students have access to advanced equipment and software, which enables them to gain hands-on experience and practical skills."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fees structure of DTU for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total tuition fee for the full-time BTech programme ranges between INR 6.06 and INR 6.42 lakh while the students who get into this college via Lateral Entry are required to pay a tuition fee of INR 2.97 lakh. Additionally, the total tuition fee for BTech (Evening) programme is INR 4 lakh. This structure of DTU fees for BTech, however, is sourced from unofficial sources. Hence is indicative. For the exact fee, students can reach out to the admission office or visit the official website for details. Additionally, for all BTech courses, aspirants are also required to pay a registration cum counselling fee of INR 1,500 on the official website of JAC Delhi which is non-refundable. When a student receives an admission offer, they are required to pay the admission fee charges (which are adjusted in the total fee) to confirm their seat."
                }
            },
            {
                "@type": "Question",
                "name": "What is the intake of DTU for the BTech Course?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total number of seats available across BTech is 2,529. These seats are under a total of 14 specialisations (as per the official website of JAC Delhi) across all categories. In this intake, 85% of the total seats are reserved for Delhi students and the remaining 15% of seats are reserved for candidates from other states and cities. For more details on the seat information, students are advised to read the JAC Delhi Information Brochure of the year of admission carefully."
                }
            },
            {
                "@type": "Question",
                "name": "What is the admission process for BTech at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "A step-by-step process for BTech admission at DTU is as follows: For BTech, students can apply via JAC Delhi website. Registration via JAC Delhi is a two-step online process where students have to fill the online application form and then make the payment of the application fee. Students should note that JAC Delhi allows additional registrations and changes in the course preference before every round. JAC Delhi admission application forms are available online. Candidates have to register online on the official website Candidates have to login into the next step and fill in their choices of colleges and courses. After that, issuance of seat allotment letters for all institutes is done by the authority along with cutoffs. After issuance of the seat allotment letter, candidates have to make the fee payment, confirm their seats and can freeze their allotted seat if they do not want any up-gradation of seat/institute as per their filled choices. After seat allotment, students are required to report to the allotted institute. After verification, candidates have to report to the allotted institute for final admission. More details on DTU BTech admission process can be checked here."
                }
            },
            {
                "@type": "Question",
                "name": "Is there an entrance conducted by DTU for admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, DTU does not conduct any entrance exam of its own for admission to any of the UG, PG or doctoral-level courses. Admission for the flagship BTech programme is based on JEE Main scores and the entire process of counselling are conducted by JAC Delhi. Further, DTU admission to all the remaining courses is mostly based on national/ university-level entrance exams, such as UCEED, GATE, CAT, MAT and CMAT, among others. However, there are a few MBA specialised courses and BBA, admission to which is offered based on the past qualifying exam (UG level) followed by an interview round."
                }
            },
            {
                "@type": "Question",
                "name": "Is MBA from DTU worth?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "In the recent 2022 MBA placements at DTU, Finance turned out to be the highest recruiting sector. Additionally, the highest salary (domestic) offered stood at INR 19 LPA and the average salary stood at INR 8.9 LPA. More key highlights of Delhi School of Management (DSM) placements 2021-22 are presented below: Particulars DTU Placement Statistics 2022 No. of companies visited 150+ No. of new recruiters 50+ the highest package (domestic) INR 19 LPA the highest package (international) INR 62.5 LPA Average package INR 8.9 LPA The MBA placements data of DSM, DTU is released by the Delhi School of Management. Hence, for more details on MBA placements at DTU, click here."
                }
            },
            {
                "@type": "Question",
                "name": "Does DTU offer BDes programme?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Delhi Technological University offers a four-year BDes programme to students in the field of Design. Starting Aug 2020, it started offering the course in Fashion Design specialisation (Check Top Fashion Design Colleges in India here) and it mentioned about starting Film Design specialisation in August 2022. Interested candidates can apply online on the official admission portal of DTU. Admisison to BDes is subject to a valid score in the UCEED exam. Interested candidates, however, are required to fulfil the minimum eligibility criteria set by the university for admission which is to be a pass out of Class 12 with Science/ Commerce/ Arts or a three-year Diploma recognised by AICTE."
                }
            },
            {
                "@type": "Question",
                "name": "What has been the trend for cut-off in BTech in Environmental Engineering at Delhi Technological University in the last few years?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The cutoff trend for B.Tech in Environmental Engineering at DTU - Delhi Technological University has been decreasing in the recent years. In 2021, the closing rank for B.Tech. in Environmental Engineering under general category for all India quota was 41389. In 2022, it decreased to 21598. Likewise, the cut off ranks have changed from 56347 to 38852 for OBC, 149540 to 101362 for SC, 265990 to 152852 for ST, 46539 to 25486 for EWS. This trend is likely to continue in the coming years, as the demand for engineering education in India continues to grow. Similar cut off trend can be seen for female candidates under all categories, however, the ranks are slightly different."
                }
            },
            {
                "@type": "Question",
                "name": "Does Delhi School of Management accept CAT scores for MBA admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, DSM accepts CAT scores for MBA admission. However, for MBA from DSM/ USME , those with a valid score in MAT can also apply. Candidates seeking admission to MBA offered via DSM or USME are required to apply online on the official website of the Common Management Admission Committee (CMAC Delhi). Additionally, they must meet the below eligibility for admission: Must have completed a UG degree with a minimum aggregate ranging between 50% and 60% (10% relaxation for SC/ST/ PwD candidates) Final year students with a proof of eligibility can also apply"
                }
            },
            {
                "@type": "Question",
                "name": "Does Delhi Technological University (DTU) offer any scholarships or financial aid for its engineering students?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Delhi Technological University (DTU) offers scholarships and financial assistance to its engineering students based on various criteria. Here are some of the scholarship and financial aid options available: Merit-cum-Means Scholarship: This scholarship is awarded to students who have scored high marks in the qualifying examination and have demonstrated financial need. Scholarship for SC/ST/OBC students: DTU provides scholarships to students belonging to SC/ST/OBC categories who are enrolled in any of the undergraduate or postgraduate programs. Scholarship for Minority Community students: DTU provides financial assistance to minority community students who are enrolled in any of the undergraduate or postgraduate programs. INSPIRE Scholarship This scholarship is awarded to students who have secured admission to any of the undergraduate or postgraduate programs at DTU and have been selected under the Inspire Scheme of the Department of Science and Technology, Government of India. Pratibha Scholarship: This scholarship is awarded to meritorious students of Delhi who have secured admission to any of the undergraduate or postgraduate programs at DTU. Additionally, DTU also provides financial assistance to students who are facing financial hardship due to any unforeseen circumstances such as a medical emergency, natural calamity, etc. Students can apply for these scholarships and financial assistance schemes through the university's website."
                }
            },
            {
                "@type": "Question",
                "name": "Is DTU worthy to join in 2024, considering the increased seat intake?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Every year, the universities and colleges change their seat intake so that every student gets an equal opportunity to pursue education from the best universities. This does not make DTU any less competitive. In 2023 as well, India Today ranked the college 9 under the ‘Engineering’ category and 8 under the ‘Engineering (Government)’ category. Every year the popularity of this university is rising but the university is not compromising with the quality of education they are offering. Check the below Shiksha student reviews on DTU:"
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission in DTU for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, you cannot get direct admission in DTU for BTech. You need to appear for the JEE Main exam and qualify with a good score. DTU accepts JEE Main scores for BTech admission in 16 specializations. The admission process for 2024-25 is not yet announced, but based on the previous year's criteria, you also need to have a minimum of 50% marks in 12th standard from the Science stream. The counseling will be conducted by JAC-Delhi. You can check the official website of DTU for more details and updates on the admission process. You can also apply online for the courses offered by the university."
                }
            },
            {
                "@type": "Question",
                "name": "Is there an entrance conducted by DTU for admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, DTU does not conduct any entrance exam of its own for admission to any of the UG, PG or doctoral-level courses. Admission for the flagship BTech programme is based on JEE Main scores and the entire process of counselling are conducted by JAC Delhi. Further, DTU admission to all the remaining courses is mostly based on national/ university-level entrance exams, such as UCEED, GATE, CAT, MAT and CMAT, among others. However, there are a few MBA specialised courses and BBA, admission to which is offered based on the past qualifying exam (UG level) followed by an interview round."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission in DTU for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates seeking admission to the BTech course at DTU cannot get direct admission. Candidates must appear for the required entrance exam to get admission to BTech at DTU. Candidates can check the eligibility and selection criteria of the course on the official website of the university. Candidates must have Physics and Chemistry in Class 12 as their main subjects to be eligible for BTech."
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission in Delhi Technological University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technology University, through 17 departments, offers UG, PG, and various other courses to students. These courses are provided across the Engineering, Economics, and various other streams. Delhi Tech University is famous for its flagship courses which are MBA and BTech."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get into DTU with CUET?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Admission to a majority of courses at DTU is subject to a valid score in national/ state/ university-level entrance exams. However, there are a few UG and PG programmes admission to which is subject to merit scores obtained by the students in their last academic and selection rounds. Delhi Technological University (DTU) does accept CUET (PG) scores for admission to its Master of Science (M.Sc) programs"
                }
            },
            {
                "@type": "Question",
                "name": "Which entrance exam do I need to write for admission to BDes at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates seeking admission must have a valid score in the UCEED exam for final admission. And to become eligible for admission to BDes at Delhi Technological University, candidates must have passed their Class 12 with Science/ Commerce/ Arts or a three-year Diploma course recognised by AICTE. After appearing for the exam, the institute releases multiple merit lists based on UCEED scores. Those who have their names on these merit lists can book their seat by paying a fee component, shared with the shortlisted students."
                }
            },
            {
                "@type": "Question",
                "name": "What is the cost BDes at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The cost of BDes at Delhi Technological University, DTU is around INR 6.4 lakh. DTU four-year BDes programme in Design. Interested candidates can apply online on the official admission portal of DTU. Admisison to BDes is subject to a valid score in the UCEED. Followed by the UCEED exam, the institute releases merit lists with the names of the shortlisted candidates. The fees is indicative, as it is sourced from various sources from the internet."
                }
            },
            {
                "@type": "Question",
                "name": "How can I apply for DTU admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "A. The application process for all the courses offered via DTU is completely online. Candidates seeking admission must apply via the following websites: For BTech, students can apply via the JAC Delhi website, i.e. jacdelhi.nic.in. Registration via JAC Delhi is a two-step online process where students have to fill out the online application form and then make the payment of the application fee. Students should note that JAC Delhi allows additional registrations and changes in the course preference before every round. Read the detailed application process here. For BDes, MTech, MDes, MSc, MBA (BA/ FBE/ EIVD), E-MBA, BA, BBA and PhD, candidates must apply via the official website of DTU For MBA via DSM and USME, candidates are required to apply via CMAC. Incomplete applications are liable to cancellation. Step 1: Visit the official website and register. Step 2: Fill in the complete application form and upload the photograph as per the instructions available in the form. Step 3: Pay the application fee and submit the form. Step 4: All candidates must take a printout of the completed form after fee payment since it needs to be carried out during the final admission round. This printed form should be affixed with the same photograph which was uploaded in the online application form."
                }
            },
            {
                "@type": "Question",
                "name": "What is the application process at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The application process for all the courses offered via DTU is completely online. Candidates seeking admission must apply via the following websites: For BTech, students can apply via the JAC Delhi website, i.e. jacdelhi.nic.in. Registration via JAC Delhi is a two-step online process where students have to fill out the online application form and then make the payment of the application fee. Students should note that JAC Delhi allows additional registrations and changes in the course preference before every round. Read the detailed application process here. For BDes, MTech, MDes, MSc, MBA (BA/ FBE/ EIVD), E-MBA, BA, BBA and PhD, candidates must apply via the official website of DTU For MBA via DSM and USME, candidates are required to apply via CMAC. Incomplete applications are liable to cancellation. Step 1: Visit the official website and register. Step 2: Fill in the complete application form and upload the photograph as per the instructions available in the form. Step 3: Pay the application fee and submit the form. Step 4: All candidates must take a printout of the completed form after fee payment since it needs to be carried out during the final admission round. This printed form should be affixed with the same photograph which was uploaded in the online application form."
                }
            },
            {
                "@type": "Question",
                "name": "What are the different MTech specialisations offered at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technological University (DTU) takes great pride in offering an extraordinary array of M.Tech programs across a wide spectrum of captivating specializations. Though the specific list of specializations may evolve from year to year, DTU consistently provides students with access to some of the most prestigious and sought-after specializations in the academic world which are: 1. Computer Science and Engineering 2. Electronics and Communication Engineering 3. Mechanical Engineering 4. Electrical Engineering 5. Civil Engineering 6. Biotechnology 7. Polymer Science and Chemical Technology 8. Renewable Energy 9. Nuclear Science and Engineering 10. Transportation Engineering 11. Applied Physics 12. Applied Mathematics 13. Environmental Engineering 14. Production Engineering 15. Software Engineering 16. Information Technology."
                }
            },
            {
                "@type": "Question",
                "name": "Who is eligible for MBA at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "All MBA aspirants seeking admission to Delhi Technological University are required to meet the following eligibility criteria for admission: Completed an undergraduate degree with an aggregate ranging between 50% and 60% (for General category students) depending on the course. 10% relaxation in the minimum required aggregate is offered to the students of SC/ ST and PwD category. Those in the final year can also apply with a proof of eligibility and graduation scores at the time of the personal interview"
                }
            },
            {
                "@type": "Question",
                "name": "What is the MBA application fee at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The application fee for all the MBA courses at DTU is INR 1,500. This fee component for the General MBA programme is the same for reserved category candidates. However, for SC/ST and PwD candidates, the registration fee is INR 750 (for MBA in BA, FBE and Entrepreneurship, Innovation and Venture Development) which needs to be paid online. The registration process will remain incomplete till the submission of the registration fee. For all courses, the application fee can be paid while filling out the application form on the official website."
                }
            },
            {
                "@type": "Question",
                "name": "Is MBA from DTU worth?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "In the recent 2022 MBA placements at DTU, Finance turned out to be the highest recruiting sector. Additionally, the highest salary (domestic) offered stood at INR 19 LPA and the average salary stood at INR 8.9 LPA. More key highlights of Delhi School of Management (DSM) placements 2021-22 are presented below: Particulars DTU Placement Statistics 2022 No. of companies visited 150+ No. of new recruiters 50+ the highest package (domestic) INR 19 LPA the highest package (international) INR 62.5 LPA Average package INR 8.9 LPA The MBA placements data of DSM, DTU is released by the Delhi School of Management. Hence, for more details on MBA placements at DTU, click here."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get into VIPS with a rank of 3044 (inside Delhi) for BBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "It is difficult to say for sure whether you will be able to get into VIPS with a rank of 3044 (inside Delhi) for BBA. The cutoff for VIPS BBA varies every year, depending on the number of applicants, the difficulty level of the entrance exam, and other factors. In 2021, the closing rank for BBA at VIPS for the general category (inside Delhi) was 391. So, if the cutoff remains similar this year, you may have a chance of getting admission. However, it is also possible that the cutoff will be higher, in which case you may not be able to get in. Here are some factors that could affect the cutoff for VIPS BBA in 2023: The number of applicants: If there are more applicants this year than last year, the cutoff is likely to be higher. The difficulty level of the entrance exam: If the entrance exam is more difficult this year than last year, the cutoff is likely to be lower. The performance of other colleges: If other colleges in Delhi have higher cutoffs for BBA, VIPS may also have a higher cutoff to attract students. The best way to know for sure whether you will be able to get into VIPS with a rank of 3044 (inside Delhi) for BBA is to wait for the cutoff to be released. You can check the cutoff on the website of Guru Gobind Singh Indraprastha University (GGSIPU) once it is released."
                }
            },
            {
                "@type": "Question",
                "name": "I have scored less than 60% in 12th boards. Can I get admission for B.Tech at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "To be eligible for applying to BTech admission at DTU, candidates must meet the minimum eligibility criteria specified by the university. For BTech admission, a candidate must have passed Class 12 with minimum 60% aggregate with PCM and English Core as subjects. The minimum aggregate for various reserved categories is 50%-55%. Hence, whether the candidate is eligible to apply for BTech admission at DTU depends on their reservation category. However, meeting the eligibility criteria does not gurantee admission at the university. The seat allocation is based on the applicant's score in JEE Main, followed by the JAC couselling. In case a candidate fails to secure a seat for BTech at DTU, they can check out other colleges offering ofline and online BTech courses."
                }
            },
            {
                "@type": "Question",
                "name": "Is DTU better than IITs for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "There is no comparison of IITs with DTU owing to the brand name IITs have for being India's best government Engineering colleges. However, as per the 2023 NIRF ranking released for Engineering colleges, DTU is closely completing with some IITs. A comparison of the similarly ranked Engineering colleges on the basis of multiple components, such as fee and median package are tabulated below: Engineering Institute NIRF Ranking 2023 BTech Fee BTech Median Salary DTU 29 INR 2.97 Lacs - INR 6.42 lakh INR 11 LPA IIT Jodhpur 30 INR 8 lakh INR 12 LPA IIT Mandi 33 INR 8 Lacs - INR 10 lakh INR 18 LPA - INR 21 LPA NOTE: The placement and fee data mentioned in the above table are sourced from unofficial sources. Hence, it is indicative."
                }
            },
            {
                "@type": "Question",
                "name": "What is the JEE Mains cut-off for B.Tech in Chemical Engineering at Delhi Technological University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For 2022, cut off was 17878 for General category candidates in All India quota for B.Tech. in Chemical Engineering in DTU - Delhi Technological University. B.Tech cut off varies depending on the category and domicile/quota of the applicant."
                }
            },
            {
                "@type": "Question",
                "name": "How many entrance exam cutoffs will be released for admission to B.Tech in Civil Engineering at Delhi Technological University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "DTU - Delhi Technological University will release 6-8 rounds of JEE Main cutoffs for admission to B.Tech. The cutoffs will be released on a rolling basis, and the seats will be filled on a first-come, first-served basis. The cutoffs will be based on the following factors: The JEE Main score of the candidate The category of the candidate The number of seats available in the course Candidates must visit the official website of entrance exam to read clear instructions on how to proceed with the counselling process, once the round is released."
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/delhi",
                    "name": "Colleges in Delhi"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920",
                    "name": "DTU"
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/admission",
                    "name": "admission"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "DTU Admissions 2025: Application, Fees, Eligibility & Selection Process",
        "description": "DTU admission 2025 is mostly entrance-based. Visit the page to know more DTU Fees, admission process, eligibility, courses & placements",
        "dateModified": "2025-03-10T17:42:00+05:30",
        "datePublished": "2024-10-04T15:12:48+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/admission",
            "@type": "WebPage",
            "name": "DTU - Delhi Technological University"
        },
        "author": {
            "@type": "Person",
            "name": "abhishekgaurav",
            "url": "https://www.shiksha.com/author/abhishek228109"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1569306404phpbokZti.jpeg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]