[
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "Can I take admission in DTU M.Tech without GATE?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Delhi Technological University also offers admission to candidates also who have AMIE/ AMIS. AMIICHE/ AMIIM/ Grad IETE or those who possess a BSc/ Diploma in Engineering degree. Such candidates are not required to have a GATE score for admission to DTU. For more details on this subject, students are advised to reach out to the admission office. Know more about DTU's M.Tech programme."
                }
            },
            {
                "@type": "Question",
                "name": "Is there an entrance conducted by DTU for admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, DTU does not conduct any entrance exam of its own for admission to any of the UG, PG or doctoral-level courses. Admission for the flagship BTech programme is based on JEE Main scores and the entire process of counselling are conducted by JAC Delhi. Further, DTU admission to all the remaining courses is mostly based on national/ university-level entrance exams, such as UCEED, GATE, CAT, MAT and CMAT, among others. However, there are a few MBA specialised courses and BBA, admission to which is offered based on the past qualifying exam (UG level) followed by an interview round."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission in DTU for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates seeking admission to the BTech course at DTU cannot get direct admission. Candidates must appear for the required entrance exam to get admission to BTech at DTU. Candidates can check the eligibility and selection criteria of the course on the official website of the university. Candidates must have Physics and Chemistry in Class 12 as their main subjects to be eligible for BTech."
                }
            },
            {
                "@type": "Question",
                "name": "Are DTU BDes admission dates out?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, admission dates for BDEs at DTU is iut for 2024. For BDes programme admission 2024 at Delhi Technological University (DTU), candidates are required to appear for The Undergraduate Common Entrance Examination for Design (UCEED). Registration for the UCEED exam has begun and the exam will be tentatively conducted in the month of January. Candidates who meet the prescribed eligibility criteria may apply for the UCEED exam."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get DTU at 93 percentile for MBA admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "DTU offers a two-year full-time MBA programme via its own campus, Delhi School of Management (DSM) and University School of Management and Entrepreneurship (USME). Delhi Technological University accepts CAT scores for admission to the MBA course. As per DTU cutoff 2022, the overall CAT percentile Cutoff was 85 for the Geneal category student. So, considering the past year cutoff trends, candidates with 93 CAT percentile can easily get admission to MBA course at DTU. Candidates can refer to the table given below to check out the past three years DTU CAT percentile for the General category students: Section 2020 2021 2022 Overall 85 85 85 Quants 50 50 50 VA-RC 50 50 50 DI-LR 50 50 50"
                }
            },
            {
                "@type": "Question",
                "name": "Do I need 75% to get into DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For admission to most of the undergraduate and postgraduate courses offered at Delhi Technological University, students are required to score 50% to 60% minimum aggregate in their last qualifying degree or course to be eligible. A course-wise list of eligibility criteria for DTU admission is mentioned in the following table: Course Name Eligibility Criteria BTech Class 12 with 60% BDes A pass in Class 12 BBA Class 12 with 50% MSc Class 12 with 50% in Economics MTech Relevant UG degree with at least 60% MDes 4-year UG with 55% E-MBA Any UG degree with 60% E-MBA UG degree with 50% MSc Relevant BSc/ UG degree with 55% E-MBA UG degree with 50% PhD Relevant PG degree with 55% Hence, as per the table, it can be concluded that while all 75% scorers will be preferred at DTU, the minimum requirement to get admission and be eligible for DTU admission is comparatively low."
                }
            },
            {
                "@type": "Question",
                "name": "Is DTU good for BDes?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technological University (DTU) is among the old and reputeed University established in 1941. DTU Delhi is accredited by the NAAC with an 'A' grade and NBA and is also approved by the University Grant Commission (UGC) and AICTE. DTU College is ranked 61 under the Overall category by NIRF 2023, 40 under the University category by NIRF 2023, and 29 under the Engineering category by NIRF 2023. The university is ISO-certified and earlier was affiliated with the University of Delhi. Placements: If compared to IIT Bombay or IIIT Delhi, placements are comparable to the best-to-best colleges. The top recruiting companies are TNP, Google, Adobe, Microsoft, Indian Express, etc."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission into DTU for MBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, it is possible. While DTU accepts CAT/ MAT or CMAT scores for admission to two of the MBA programmes offered by it. Admission to MBA programme in Family Business & Entrepreneurship and MBA in Entrepreneurship, Innovation & Venture Development is subject to candidates' performance at the undergraduate level and in the interview conducted by the university campus. For the remaining MBA courses, performance in CAT/ MAT or CMAT is considered along with students' performance in the last qualifying degree and interview conducted at the university-level. Additionally, all the candidates are required to meet the following eligibility criteria for admission: Must have completed a UG degree with an aggregate ranging between 50% and 60% (for General category students) depending on the course Those in the final year can also apply with a proof of eligibility"
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission in DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "To get admission to BTech at DTU, go to the site of JAC Delhi and register yourself and according to the schedule attend the counseling. On the day of counseling bring all the required certificates as mentioned on the website of JAC Delhi. The list will come out on the website itself and you are done after paying all the fees. The admission is solely dependent on the rank in JEE MAIN. Check all the cutoffs of the previous years before attending the counselling."
                }
            },
            {
                "@type": "Question",
                "name": "What is the last date to apply at DTU for BDes?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technological University conducted the application process for BDes admission 2023 on the official website between April 10 and May 20. Just like the academic year 2022-23, the application for BDes at DTU for 2023 was over by the last week of May. This was followed by the release of first merit list for BDes admission at DTU on May 24. A detailed schedule for BDes admission at DTU is as follows: Event BDes Admission Dates at DTU Application 10 Apr '23 - 10 May '23 1st round merit list and wait list 24 May '23 1st round admission - shortlisted candidates are required to report with original documents & DD 30 May '23 2nd round merit list and wait list 2 Jun '23 2nd round admission - shortlisted candidates are required to report with original documents & DD 14 Jun '23 Vacant seats for 3rd round 21 Jun '23 Vacant seats 3rd round admission process - shortlisted candidates are required to report with original documents & DD 27 Jun '23 Display of vacant seats for spot round 4 Jul '23 Spot round admission 11 Jul '23"
                }
            },
            {
                "@type": "Question",
                "name": "Does Delhi Technological University (DTU) offer any scholarships or financial aid for its engineering students?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Certainly, Delhi Technological University (DTU) has made it a priority to ensure that finance is not a barrier for its engineering students to access quality education. The university offers various scholarships and financial aid options, which are carefully designed to meet the diverse needs of its students. DTU's scholarship programs are offered to students who exhibit outstanding academic performance and economic needs. The scholarships recognize and reward academic excellence, providing an incentive for students to strive for excellence and achieve their full potential. At the same time, the university offers financial assistance to students who face economic challenges, enabling them to pursue their studies without financial difficulties."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fee for BDes at Delhi Technological University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total tuition fee for BDes is INR 6.42 lakh. This fee is sourced from unofficial sources. Hence, is purely indicative. For the exact fee for the academic year 2023-24, students ae required to visit the official website of the university or reach out to the admission office. Additionally, a sum of INR 1,500 is also required to be paid to the university as the application charges (for the General catgeory). This amount is non-refundable. In addition to the tuition fee and application charges, there are numerous other components which are part of the total cost. These components include facilities and service charges, exam fee, mediclaim premium amount and student welfare fee. Get more information on BDes fee at DTU here."
                }
            },
            {
                "@type": "Question",
                "name": "What is the cost BDes at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The cost of BDes at Delhi Technological University, DTU is around INR 6.4 lakh. DTU four-year BDes programme in Design. Interested candidates can apply online on the official admission portal of DTU. Admisison to BDes is subject to a valid score in the UCEED. Followed by the UCEED exam, the institute releases merit lists with the names of the shortlisted candidates. The fees is indicative, as it is sourced from various sources from the internet."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fees structure of DTU for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total tuition fee for the full-time BTech programme ranges between INR 6.06 and INR 6.42 lakh while the students who get into this college via Lateral Entry are required to pay a tuition fee of INR 2.97 lakh. Additionally, the total tuition fee for BTech (Evening) programme is INR 4 lakh. This structure of DTU fees for BTech, however, is sourced from unofficial sources. Hence is indicative. For the exact fee, students can reach out to the admission office or visit the official website for details. Additionally, for all BTech courses, aspirants are also required to pay a registration cum counselling fee of INR 1,500 on the official website of JAC Delhi which is non-refundable. When a student receives an admission offer, they are required to pay the admission fee charges (which are adjusted in the total fee) to confirm their seat."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fee for M.Tech at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total tuition fee for M.Tech ranges between INR 2.1 Lacs and INR 3.1 lakh. This fee, however, is sourced from unofficial sources. Hence is indicative. For the exact fee, students can reach out to the admission office or visit the official website for details. Additionally for MTech, aspirants are also required to pay the registration fee ranging between INR 1,350 and 2,250 (depending on their category) while registring for GATE which is non-refundable. Non-GATE participants and all other candodates, however who are applying to DTU via the official website are required to pay an application fee of INR 1,500."
                }
            },
            {
                "@type": "Question",
                "name": "How much is the fee for DTU courses?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Details of the total tuition fee charged by DTU for most of its UG and PG programmes is tabulated below. This fee, however, is sourced from unofficial sources. Hence, is indicative. Course Name Total Fee MDes INR 2.97 Lacs - INR 6.42 lakh MDes INR 6.42 lakh MA width=\"52%\"> INR 1.76 lakh BA (Hons) in Economics INR 1.76 lakh MTech INR 1.2 Lacs - INR 3.32 lakh MDes INR 2.88 lakh MBA INR 2.87 Lacs - INR 2.95 lakh MA in Economics INR 4.3 lakh MSc INR 36,000 BA5 width=\"52%\"> INR 3.75 lakh PhD NA"
                }
            },
            {
                "@type": "Question",
                "name": "What is the MBA application fee at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The application fee for all the MBA courses at DTU is INR 1,500. This fee component for the General MBA programme is the same for reserved category candidates. However, for SC/ST and PwD candidates, the registration fee is INR 750 (for MBA in BA, FBE and Entrepreneurship, Innovation and Venture Development) which needs to be paid online. The registration process will remain incomplete till the submission of the registration fee. For all courses, the application fee can be paid while filling out the application form on the official website."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fee for MBA at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total tuition fee for MBA is INR 2.87 Lacs and INR 2.95 lakh. This fee, however, is sourced from unofficial sources. Hence, is indicative. Additionally, the application fee for all courses at DTU INR 1,500 for General and OBC category candidates; and for SC/ST and PwD candidates, the registration fee is INR 750 which needs to be paid online. The registration process will remain incomplete till the submission of the registration fee. For all courses, the application fee can be paid while filling the application form on the official website For BTech, aspirants first need to pay the registration cum counselling fee of INR 1,500 on the official website of JAC Delhi which is non-refundable. To pay the fee, aspirants will have to enter their JEE (Main) Roll No, Mobile No and E-Mail ID."
                }
            },
            {
                "@type": "Question",
                "name": "Is there a separate entrance exam to get admission in DTU for B.Tech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For BTech admission, DTU accepts JEE Main followed by JAC counselling and the entire admission process is conducted via Joint Admission Counselling (JAC) Delhi. To be eligible, candidates must fulfil the below eligibility criteria: Delhi Region candidates (85% of seats): Aspirants passing the qualifying exam from a recognised school/ college/ institute located within the National Capital Territory (NCT) of Delhi will be considered for the Delhi Region only Outside Delhi Region candidates (15% of seats): Aspirants passing the qualifying examination from a recognised school/ college/ institute located outside the National Capital Territory of Delhi will be considered for Outside Delhi Region only."
                }
            },
            {
                "@type": "Question",
                "name": "What are the different MTech specialisations offered at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technological University (DTU) takes great pride in offering an extraordinary array of M.Tech programs across a wide spectrum of captivating specializations. Though the specific list of specializations may evolve from year to year, DTU consistently provides students with access to some of the most prestigious and sought-after specializations in the academic world which are: 1. Computer Science and Engineering 2. Electronics and Communication Engineering 3. Mechanical Engineering 4. Electrical Engineering 5. Civil Engineering 6. Biotechnology 7. Polymer Science and Chemical Technology 8. Renewable Energy 9. Nuclear Science and Engineering 10. Transportation Engineering 11. Applied Physics 12. Applied Mathematics 13. Environmental Engineering 14. Production Engineering 15. Software Engineering 16. Information Technology."
                }
            },
            {
                "@type": "Question",
                "name": "Is DTU good for M.Sc.?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "{Source: M.Sc. students & alumni} Good points: * Placement: The average package for M.Sc. courses is 7 to 8 Lacs per annum, with PPOs and internships available from the final year or 3rd semester onwards. * Faculty: Faculty members are highly qualified, trained, and experienced, with many having PhDs from reputed institutions. * Curriculum: The curriculum is designed to prepare students for jobs in research, pharmaceuticals, and edtech, covering all necessary topics. * Infrastructure: The campus is well-maintained, with modern infrastructure, including air-conditioned classrooms, state-of-the-art libraries, and sports complexes. * Campus life: Campus life is vibrant, with various societies, festivals, and events, providing a diverse student community. * Hostels: The hostel facilities are comfortable, with options ranging from single-seater to multi-sharing rooms, and amenities like air-conditioning, Wi-Fi, and laundry facilities. Not-so-good points: * Limited internship opportunities: While PPOs and internships are available, some students might find limited opportunities in their desired fields. * Semester exams: Some students found the semester exams challenging, requiring dedicated effort to pass. * Lab facilities: While the labs are well-managed, some students felt that the facilities could be improved. Overall, DTU seems to offer a good learning environment, decent placement opportunities, and a strong faculty base. However, individual experiences may vary, and students should weigh these pros and cons before making a decision."
                }
            },
            {
                "@type": "Question",
                "name": "Who is eligible for the BDes at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "At the UG level, Delhi Technological University also offers a four-year BDes programme in Design. Interested candidates can apply online on the official admission portal of DTU. Admisison to BDes is subject to a valid score in the DTU.4 Followed by the UCEED exam, the institute releases merit lists with the names of the shortlisted candidates. More details about the DTU BDes course are as follows: Eligibility: Twelve years of school education with Science/ Commerce/ Arts or a three-year Diploma recognised by AICTE"
                }
            },
            {
                "@type": "Question",
                "name": "Does Delhi School of Management accept CAT scores for MBA admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, DSM accepts CAT scores for MBA admission. However, for MBA from DSM/ USME , those with a valid score in MAT can also apply. Candidates seeking admission to MBA offered via DSM or USME are required to apply online on the official website of the Common Management Admission Committee (CMAC Delhi). Additionally, they must meet the below eligibility for admission: Must have completed a UG degree with a minimum aggregate ranging between 50% and 60% (10% relaxation for SC/ST/ PwD candidates) Final year students with a proof of eligibility can also apply"
                }
            },
            {
                "@type": "Question",
                "name": "Which are the top 5 BTech specialisations offered at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "As per the JEE Main Round 1 cutoff released by DTU for admission to the BTech programme, BTech CSE, IT, Software Engineering, Mathematics & Computer Engineering and Electronics and Communication Engineering are the top five and most competitive specialisations offered here. The below table mentions the closing ranks of round 1 for all these specialisations for the past three years. JEE Main Round 1 Closing Rank (General-All India) Course 2021 2022 2023 BTech in Computer Science and Engineering 2445 4008 2647 BTech in Information Technology 4142 5110 3114 BTech in Software Engineering 4836 5871 3680 BTech in Mathematics and Computing Engineering 6271 6190 3736 BTech in Electronics and Communication Engineering 9278 7608 4540 Having said that, the selection of specialisations must be dependent on the choice and interest of the candidate before anything else."
                }
            },
            {
                "@type": "Question",
                "name": "Are JEE Mains date out for admission at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, JEE Main Admission dates for admission to BTech at DTU. DTU Admission 2023 has ended with the spot admission for BTech. Candidates have to watch out for JEE Main exam dates 2024. JEE Mains 2024: NTA has released the JEE Main Application Form 2024. Candidates can fill the application form using the NTA JEE Mains 2024 registration link given here or from the JEE Main Registration NTA website jeemain.nta.ac.in 2024. JEE Main 2024 Registration last date session 1 is November 30. Details of how to fill JEE Mains Form 2024, documents required for JEE Mains registration, and JEE Mains form fees are given here. Candidates should apply before the JEE Main 2024 form fill up date."
                }
            },
            {
                "@type": "Question",
                "name": "Is DTU a good option for MTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The median salary for M.Tech at DTU stood at INR 10 Lacs for the academic year 2021 as per the NIRF report 2022. Other than the placements, DTU got ranked on position 35 for Engineering category. Hence, it is considered a good option for MTech. Further, as per the verified students’ reviews on Shiksha, the institute offers all the necessary amenities to the students with respect to well-equipped laboratories with all the necessary instruments, computers and software according to students' needs, a spacious library with all kinds of books to enhance the knowledge of students. Hence, DTU can be considered a decent option for MTech."
                }
            },
            {
                "@type": "Question",
                "name": "What all courses are offered by DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "DTU comprises the DTU main campus, University School of Management and Entrepreneurship (also called DTU East Delhi campus) and the Delhi School of Management (DSM). Together they offer UG, PG and doctoral programmes in the field of Engineering, Design, Science and Management. The admission process is completely online and is conducted via the official website of DTU, DSM, USME or related counselling bodies. Most popular for its BTech programme, Delhi Technological University (DTU) admission for BTech is based on JEE Main scores and the entire process of counselling is conducted by CMAT, Delhi. DTU admission to all the remaining courses is based on national/ university-level entrance exams, such as UCEED, GATE, CMAT, CMAT, among others. However, there are a few MBA specialised courses and BBA, admission to which is offered based on the past qualifying exam (UG level) followed by an interview round."
                }
            },
            {
                "@type": "Question",
                "name": "Are UCEED dates out for admission to DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, UCEED dates are out for admission to DTU. The registration process is ongoing, and the application fee with late fees is from 14 - 20 November 2023. IIT Bombay will conduct the UCEED 2024 exam on January 21, 2024 (9 am - 12 noon). The UCEED 2024 exam will have two mandatory parts. The computer-based Part A and offline-based Part B."
                }
            },
            {
                "@type": "Question",
                "name": "Are Admission dates out for MBA at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "DTU MBA admission dates 2024 are out on the university's official website. DTU MBA application process 2024 has been commenced from Mar 19 and will tentatively conclude on Apr 19 as per the institute's website. The shortlist for the PI process will tentatively be released on Apr 30, 2024. The document verification and PI for the shortlisted candidates will tentatively take place between May 13, 2024 and May 17, 2024."
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission in DTU for BDes?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "To get Admission in DTU - Delhi Technological University's BDes course, candidates need to have a valid score in the qualifying exam: The Undergraduate Common Entrance Examination for Design (UCEED). UCEED is a national-level exam conducted by IIT Bombay for admission to the BDes program at the following participating institutes: IIT Bombay, IIT Delhi, IIT Guwahati, IIT Hyderabad, and IIITDM Jabalpur. Also before applying for the UCEED exam, candidates are required to be eligibile i.e. Twelve years of school education with Science/ Commerce/ Arts or a three-year Diploma recognised by AICTE."
                }
            },
            {
                "@type": "Question",
                "name": "What is the application process for MBA at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technological University application process for all the courses offered via DTU is completely online. Candidates seeking admission must apply via the following websites: For BDes, MTech, MDes, MSc, MBA (BA/ FBE/ EIVD), E-MBA, BA, BBA and PhD, candidates must apply via the official website of DTU For MBA via DSM and USME, candidates are required to apply via CMAC. Incomplete applications are liable to cancellation. Step 1: Visit the official website and register. Step 2: Fill in the complete application form and upload the photograph as per the instructions available in the form. Step 3: Pay the application fee and submit the form. Step 4: All candidates must take a printout of the completed form after fee payment since it needs to be carried out during the final admission round. This printed form should be affixed with the same photograph which was uploaded in the online application form."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get DTU with 80 percentile in JEE Main via JAC Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Usually, the cutoff for DTU stays around 90, even for the reserved categories. Therefore, getting into B.Tech courses at DTU is difficult with a JEE Main percentile score of 90 or below. The cutoff also goes high and low every year, depending on the following factors: Number of aspirants registered, The difficulty level of the exam, Total number of seats available, total number of applications received for a particular program, and the category under which admission is sought. Therefore, it is very difficult to predict the exact cutoff and give an exact answer to this question."
                }
            },
            {
                "@type": "Question",
                "name": "What to do after JEE Main session 2 result?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates preparing for IITs are only required to appear for the JEE Advanced entrance exam after qualifying JEE Main. Students who who secure above the 98th percentile in JEE Main 2024 Session 2 should start preparing for JEE Advanced 2025 immediately. Those who score between 95th and 98th percentile should focus on improving their JEE Main score by taking multiple mock tests and practicing previous year's question papers. By analysing their strengths and weaknesses, candidates can identify their areas of proficiency and topics where they need improvement. If they can achieve full marks in their practice sessions, they can start preparing for JEE Advanced. However, if they cannot score full marks, it is recommended that they appear for multiple mock test series for more practice."
                }
            },
            {
                "@type": "Question",
                "name": "What is the cutoff for B.Tech IT at Delhi Technological University for candidates other than general categories?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The last year 2022 cutoff ranks for B.Tech. in Information Technology at DTU - Delhi Technological University for candidates other than General category are - 13239 for OBC, 37373 for SC, 66752 for ST, 7279 for EWS. While the admissions are based on the scores/rank obtained in JEE exam, the last cut offs also change a lot depending on All India quota or Home State. It also varies if the applicant is a female."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get DTU with 40000 rank for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technological University JAC Delhi cutoff 2024 is released for admisison to the BTech courses. The closing cutoff ranged between 8336 and, 54432. Candidates with a 40000 rank have the opportunity to enroll in Delhi Technological University for certain BTech specialisations. Candidates can refer to the table below to check out the specialisations available for admission up to 40000 rank in JAC Delhi at DTU: Course 2024 B.Tech. in Civil Engineering 50194 B.Tech. in Production and Industrial Engineering 47199 B.Tech. in Environmental Engineering 53310 B.Tech. in Biotechnology 54432 B.Tech. in Software Engineering 14845 B.Tech. in Chemical Engineering 42504"
                }
            },
            {
                "@type": "Question",
                "name": "What is the lowest rank to get into DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The lowest or least competitive rank to get into DTU (Delhi Technological University) varies depending on the course and the category of the candidate. For instance, as per DTU JEE Main cutoff 2024, the lowest rank was 17367 for BTech in Biotechnology for General Category candidates. However, ranks for other categories may be different. DTU cutoff ranks for different courses and categories may vary every year based on various factors like the difficulty level of the exam, the number of applicants, and reservation policies. Important: Predict your admission chances here with JEE Main 2024 College Predictor"
                }
            },
            {
                "@type": "Question",
                "name": "What is the fees structure of DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Tabulated below are the fees for all the courses offered at Delhi Technological University, DTU: Courses Total tuition Fees MBA/PGDM INR 2.9 lakh B.Des INR 6.4 lakh BE INR 4.3 lakh BTech INR3 Lacs - INR 6.4 lakh MDes INR 1.2 lakh - INR 3.3 lakh MSc INR 36,000 BA INR 1.8 lakh BBA INR 1.8 lakh MDes INR 2.9 lakh MBA INR 3.8 lakh NOTE: This fee and fee-breakup available is sourced from unofficial sources. Hence, is indicative."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get admission to Delhi Technological University in BTech CSE if my rank is under 5000?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For last year, the closing rank for B.Tech. in Computer Science and Engineering was 4008 which is very close to this range. This was for general category under All India quota. Unless the candidate belongs to some other category or domicile, one cannot afford to score less than this. With this rank, there is a probability of getting admission however since, the cut offs keep changing year on year, it is advisable to try to score better ranks to increase your chances of getting admission in DTU - Delhi Technological University."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get into VIPS with a rank of 3044 (inside Delhi) for BBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "It is difficult to say for sure whether you will be able to get into VIPS with a rank of 3044 (inside Delhi) for BBA. The cutoff for VIPS BBA varies every year, depending on the number of applicants, the difficulty level of the entrance exam, and other factors. In 2021, the closing rank for BBA at VIPS for the general category (inside Delhi) was 391. So, if the cutoff remains similar this year, you may have a chance of getting admission. However, it is also possible that the cutoff will be higher, in which case you may not be able to get in. Here are some factors that could affect the cutoff for VIPS BBA in 2023: The number of applicants: If there are more applicants this year than last year, the cutoff is likely to be higher. The difficulty level of the entrance exam: If the entrance exam is more difficult this year than last year, the cutoff is likely to be lower. The performance of other colleges: If other colleges in Delhi have higher cutoffs for BBA, VIPS may also have a higher cutoff to attract students. The best way to know for sure whether you will be able to get into VIPS with a rank of 3044 (inside Delhi) for BBA is to wait for the cutoff to be released. You can check the cutoff on the website of Guru Gobind Singh Indraprastha University (GGSIPU) once it is released."
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/delhi",
                    "name": "Colleges in Delhi"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920",
                    "name": "DTU"
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/courses",
                    "name": "Courses"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "DTU Courses: UG, PG, Doctorate Courses & Fees 2025",
        "description": "Check 10  courses and their fee details at DTU, Delhi. Find details of all  UG & PG degree, diploma and certification programs offered by DTU along with course Duration, Reviews, Eligibility & Apply Dates",
        "dateModified": "2025-01-06T16:58:00+05:30",
        "datePublished": "2024-10-04T15:50:46+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/courses",
            "@type": "WebPage",
            "name": "DTU - Delhi Technological University"
        },
        "author": {
            "@type": "Person",
            "name": "SaumyaSrivastava",
            "url": "https://www.shiksha.com/author/Saumya160079"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1569306404phpbokZti.jpeg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "ItemList",
        "name": "DTU Courses: UG, PG, Doctorate Courses & Fees 2025",
        "description": "Check 10  courses and their fee details at DTU, Delhi. Find details of all  UG & PG degree, diploma and certification programs offered by DTU along with course Duration, Reviews, Eligibility & Apply Dates",
        "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/courses",
        "numberOfItems": "20",
        "itemListElement": [
            {
                "@type": "ListItem",
                "name": "B.Tech. in Electronics and Communication Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-electronics-and-communication-engineering-52813",
                "position": 1
            },
            {
                "@type": "ListItem",
                "name": "Master of Business Administration (MBA) at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/college/delhi-school-of-management-dtu-rohini-37974/course-master-of-business-administration-mba-191166",
                "position": 2
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Computer Science and Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-computer-science-and-engineering-52819",
                "position": 3
            },
            {
                "@type": "ListItem",
                "name": "Executive Master of Business Administration (EMBA) at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/college/delhi-school-of-management-dtu-rohini-37974/course-online-executive-master-of-business-administration-emba-192809",
                "position": 4
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Mechanical Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-mechanical-engineering-52823",
                "position": 5
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Civil Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-civil-engineering-52825",
                "position": 6
            },
            {
                "@type": "ListItem",
                "name": "Discontinued (Jun 2023)- B.Tech. in Polymer Science and Chemical Technology at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-discontinued-jun-2023-b-tech-in-polymer-science-and-chemical-technology-84719",
                "position": 7
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Mechanical Engineering (Automotive Engineering) at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-mechanical-engineering-automotive-engineering-84732",
                "position": 8
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Biotechnology at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-biotechnology-84718",
                "position": 9
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Environmental Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-environmental-engineering-52830",
                "position": 10
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Electrical Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-electrical-engineering-84722",
                "position": 11
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Production and Industrial Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-production-and-industrial-engineering-52828",
                "position": 12
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Information Technology at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-information-technology-84717",
                "position": 13
            },
            {
                "@type": "ListItem",
                "name": "M.Sc. in Physics at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-m-sc-in-physics-111893",
                "position": 14
            },
            {
                "@type": "ListItem",
                "name": "Ph.D. in Applied Chemistry and Polymer Technology at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-ph-d-in-applied-chemistry-and-polymer-technology-111895",
                "position": 15
            },
            {
                "@type": "ListItem",
                "name": "Ph.D. in Mechanical and Production Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-ph-d-in-mechanical-and-production-engineering-111897",
                "position": 16
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Engineering Physics at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-engineering-physics-193865",
                "position": 17
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Mathematics and Computing Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-mathematics-and-computing-engineering-193866",
                "position": 18
            },
            {
                "@type": "ListItem",
                "name": "B.Tech. in Software Engineering at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-b-tech-in-software-engineering-193867",
                "position": 19
            },
            {
                "@type": "ListItem",
                "name": "Bachelor of Technology (B.Tech. Lateral Entry) at DTU, Rohini, Delhi",
                "url": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/course-bachelor-of-technology-b-tech-lateral-entry-230254",
                "position": 20
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]