[
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "What is the lowest rank to get into DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The lowest or least competitive rank to get into DTU (Delhi Technological University) varies depending on the course and the category of the candidate. For instance, as per DTU JEE Main cutoff 2024, the lowest rank was 17367 for BTech in Biotechnology for General Category candidates. However, ranks for other categories may be different. DTU cutoff ranks for different courses and categories may vary every year based on various factors like the difficulty level of the exam, the number of applicants, and reservation policies. Important: Predict your admission chances here with JEE Main 2024 College Predictor"
                }
            },
            {
                "@type": "Question",
                "name": "Can I get DTU with 80 percentile in JEE Main via JAC Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Usually, the cutoff for DTU stays around 90, even for the reserved categories. Therefore, getting into B.Tech courses at DTU is difficult with a JEE Main percentile score of 90 or below. The cutoff also goes high and low every year, depending on the following factors: Number of aspirants registered, The difficulty level of the exam, Total number of seats available, total number of applications received for a particular program, and the category under which admission is sought. Therefore, it is very difficult to predict the exact cutoff and give an exact answer to this question."
                }
            },
            {
                "@type": "Question",
                "name": "What are the most competitive branches at DTU considering the JEE Main cutoff 2023?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "DTU JEE Main cutoff 2023 was concluded after Round 5 of the Seat Allotment Result. As per the JEE Main cutoff 2023, the most competitive branches at DTU (Delhi Technological University) are: 1. Computer Science and Engineering (CSE): The last round closing rank for CSE at DTU for JEE Main 2023 was 4876 (General-All India), while it was 4008 and 2445 in 2022 and 2021, respectively. 2. Information Technology (IT): The closing rank for IT at DTU in last round of JEE Main 2023 was 6424 (General-All India), while it was 5110 and 4142 in 2022 and 2021, respectively. 3. Software Engineering: DTU last round closing rank for Software Engineering for JEE Main 2023 was 7157 (General-All India), while it was 5871and 4836 in 2022 and 2021, respectively. These branches are highly sought after, and the cutoffs are relatively lower compared to other branches. However, it's essential to note that the cutoffs may vary based on various factors, such as the number of seats available, the difficulty level of the exam, and the number of applicants."
                }
            },
            {
                "@type": "Question",
                "name": "What to do after JEE Main session 2 result?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates preparing for IITs are only required to appear for the JEE Advanced entrance exam after qualifying JEE Main. Students who who secure above the 98th percentile in JEE Main 2024 Session 2 should start preparing for JEE Advanced 2025 immediately. Those who score between 95th and 98th percentile should focus on improving their JEE Main score by taking multiple mock tests and practicing previous year's question papers. By analysing their strengths and weaknesses, candidates can identify their areas of proficiency and topics where they need improvement. If they can achieve full marks in their practice sessions, they can start preparing for JEE Advanced. However, if they cannot score full marks, it is recommended that they appear for multiple mock test series for more practice."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get DTU at 93 percentile for MBA admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "DTU offers a two-year full-time MBA programme via its own campus, Delhi School of Management (DSM) and University School of Management and Entrepreneurship (USME). Delhi Technological University accepts CAT scores for admission to the MBA course. As per DTU cutoff 2022, the overall CAT percentile Cutoff was 85 for the Geneal category student. So, considering the past year cutoff trends, candidates with 93 CAT percentile can easily get admission to MBA course at DTU. Candidates can refer to the table given below to check out the past three years DTU CAT percentile for the General category students: Section 2020 2021 2022 Overall 85 85 85 Quants 50 50 50 VA-RC 50 50 50 DI-LR 50 50 50"
                }
            },
            {
                "@type": "Question",
                "name": "Can I get DTU with 40000 rank for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technological University JAC Delhi cutoff 2024 is released for admisison to the BTech courses. The closing cutoff ranged between 8336 and, 54432. Candidates with a 40000 rank have the opportunity to enroll in Delhi Technological University for certain BTech specialisations. Candidates can refer to the table below to check out the specialisations available for admission up to 40000 rank in JAC Delhi at DTU: Course 2024 B.Tech. in Civil Engineering 50194 B.Tech. in Production and Industrial Engineering 47199 B.Tech. in Environmental Engineering 53310 B.Tech. in Biotechnology 54432 B.Tech. in Software Engineering 14845 B.Tech. in Chemical Engineering 42504"
                }
            },
            {
                "@type": "Question",
                "name": "Which is a better college to pursue CSE, DTU or NSIT?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Both DTU and NSUT accepts JEE Main scores, followed by JAC Delhi counselling process for admission to the BTech courses. As per the JEE Main 2024 cutoff, the closing rank for CSE was 5864 during the Round 4 Seat Allotment for the General AI category students. While for NSUT, the Round 4 closing rank stood at 6058. So, considering the cutoff, DTU is comparitely more tough to get into for CSE admission. As per the NIRF 2023 rankings, DTU was ranked 29th and NSUT was ranked 60th position in the Engineering category. Candidates can refer to the table below to consider other aspects, such as the CSE course fee and the average package for both institutes, before making a decision. College CSE Total Tuition Fees Median Package 2023 DTU INR 3.54 Lakh INR 13 LPA NSUT INR 3.54 Lakh INR 16 LPA Note: NSUT offers Computer Engineering."
                }
            },
            {
                "@type": "Question",
                "name": "What was the JAC Delhi cutoff 2023 for BTech in CSE at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Delhi Technological University (DTU) accepts JEE Main score, followed by JAC Delhi counselling for admission to the BTech courses. DTU Cutoff 2023 was concluded after the release of JAC Delhi Round 5 Seat Allotment Result. As per the DTU JAC Delhi cutoff 2023, the last round closing ranks was 4876 for BTech in CSE course. The Round 1 closing rank for BTech in Computer Science and Engineering was 2647 for the General All India category students. Candidates can refer to the table given below to check out the DTU JAC Delhi last round cutoff 2023 for the General category candudates: BTech Specialisations Last Round Cutoff 2023 Electronics and Communication Engineering 8677 Computer Science and Engineering 4876 Mechanical Engineering 16372 Civil Engineering 21106 Production and Industrial Engineering 21109 Environmental Engineering 23177 Information Technology 6424 Biotechnology 23469 Electrical Engineering 11963 Mechanical Engineering (Automotive Engineering) 15959 Engineering Physics 15302 Mathematics and Computing Engineering 7980 Software Engineering 7157 Chemical Engineering 18459"
                }
            },
            {
                "@type": "Question",
                "name": "What is the schedule for DASA UG 2025 for DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Direct Admission of Students Abroad (DASA) Scheme is under the Ministry of Education (MoE), Government of India for admission to Undergraduate programmes in Engineering/Architecture/ Planning for the Academic offered by the National Institute of Technology Calicut. The registration for DASA UG exam will commence from next year in July. Check out the related tentative schedule for DTU DASA UG 2025 from the table given below: Dates Upcoming Exam Dates Jun '25 DASA 2025 registration TENTATIVE Jun '25 DASA 2025 choice filling and submission TENTATIVE Jun '25 DASA 2025 withdrawal of application by TENTATIVE Jun '25 DASA 2025 Rank Declaration TENTATIVE Jul '25 DASA 2025 Mock Seat Allotment TENTATIVE Jul '25 DASA 2025 choice filling options reopening & Submission TENTATIVE Jul '25 DASA 2025 Seat Allotment - Round 1 TENTATIVE Jul '25 DASA 2025 Confirmation by candidates who have been allotted a seat in Round 1 TENTATIVE Jul '25 DASA 2025 Seat Allotment - Round 2 TENTATIVE Jul '25 DASA 2025 Confirmation by candidates who have been allotted a seat in Round 2 TENTATIVE Jul '25 DASA 2025 Seat Allotment - Round 3 TENTATIVE Jul '25 DASA 2025 Confirmation by the candidates who have been allotted a seat in Round 3 TENTATIVE Jul '25 DASA 2025 Withdrawal option TENTATIVE Jul '25 DASA 2025 Seat Allotment - Round 4 (Final) TENTATIVE Jul '25 DASA 2025 Confirmation by the candidates who have been allotted a seat in Round 4 (Final) TENTATIVE Jul '25 DASA 2025 Online reporting to allotted Institutes for admission by the candidates who have been allotted seats TENTATIVE Jul '25 DASA 2025 Internal Sliding TENTATIVE Jul '25 DASA 2025 Choice refilling for Special Round TENTATIVE Aug '25 DASA 2025 Seat Allotment - Special Round TENTATIVE Aug '25 DASA 2025 Physical reporting to allotted Institutes for admission by all candidates TENTATIVE"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/delhi",
                    "name": "Colleges in Delhi"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920",
                    "name": "DTU"
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/cutoff",
                    "name": "Cutoff"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "DTU Cutoff 2025: Check JEE Main Previous Years Ranks & Trends ",
        "description": "Check DTU - Delhi Technological University Cutoffs for 2024, 2023, 2022 and latest Cutoff trends for various courses. Download Brochures & Round-wise Cut off details of DTU.",
        "dateModified": "2025-02-04T11:45:00+05:30",
        "datePublished": "2014-08-05T15:21:56+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/cutoff",
            "@type": "WebPage",
            "name": "DTU - Delhi Technological University"
        },
        "author": {
            "@type": "Person",
            "name": "Yatendra Kumarnull",
            "url": "https://www.shiksha.com/author/YatendraKumar94720"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1569306404phpbokZti.jpeg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]