[
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "Does DTU have 100% placement?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The University has not released the placement rate. However, the other placement statistics have been released. The total count of students placed from the 2024 batch was more than 1,900. The table below depicts the exact number: Particulars Placement Statistics (2024) Students placed 1,900+ The University has also disclosed the number of students registered and the number of students placed over the past three years of Delhi Technological University placements for BTech, MTech and MBA courses, which are as follows: Particulars Placement Statistics (2021) Placement Statistics (2022) Placement Statistics (2023) Students registered for placements - BTech: 1,789 - MTech: 191 - MBA: 244 - BTech: 1,881 - MTech: 266 - MBA: 267 - BTech: 2,167 - MTech: 282 - MBA: 235 No. of students placed - BTech: 1,075 - MTech: 132 - MBA: 56 - BTech: 1,455 - MTech: 191 - MBA: 167 - BTech: 1,499 - MTech: 207 - MBA: 115"
                }
            },
            {
                "@type": "Question",
                "name": "What is the average placement package at Delhi Technological University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The overall average package for the academic year 2023-24 stood at INR 15.45 LPA. Looking at the past three years' stats, a fluctuating trend was recorded in the average package. The table below illustrates the DTU average package trends for the past three years: Particulars Placement Statistics (2022) Placement Statistics (2023) Placement Statistics (2024) Average package INR 16.05 LPA INR 16.71 LPA INR 15.45 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "What is the highest package offered at Delhi Technological University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The DTU highest package offered during 2024 placements was INR 85.30 LPA and was made by Atlassian. The table below mentions the Delhi Technological University packages for 2024: Particulars Placement Statistics (2024) Highest package INR 85.30 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "Where are DTU alumni working?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "According to unofficial sources, a large share of DTU alumni is working in the Engineering sector with a 28% share. The other top sectors that involve the majority of alumni are Operations and Education. The pie chart below illustrates the detailed sector-wise distribution of alumni: NOTE: The sectors involved in the 'Others' category are Media and Communication, Arts and Design, Information Technology, Sales, and Marketing."
                }
            },
            {
                "@type": "Question",
                "name": "Does DTU have good placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The University is well-known for its Engineering and Management courses. A total of 2,053 job offers were distributed among the 1,900 students placed during the 2024 placements. The table below depicts the DTU placement statistics for 2024: Particulars Placement Statistics (2024) No. of offers 2,053 No. of offers with CTC above INR 20 LPA 326 Students placed 1,900+ Total recruiters 350+"
                }
            },
            {
                "@type": "Question",
                "name": "What is the highest package offered to CSE students at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The DTU highest package offered during BTech COE and M.Tech CSE placements 2023 stood at INR 82.05 LPA and INR 36 LPA. The table below showcases the Delhi Technological University packages trend for better understanding: Course the highest Package (2021) the highest Package (2022) the highest Package (2023) BTech in Computer Engineering (COE) INR 112 LPA INR 184 LPA INR 82.05 LPA MTech in Computer Science & Engineering (CSE) INR 33 LPA INR 40 LPA INR 36 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "How are the placements for CSE at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "All the 20 MTech CSE students who registered for 2023 placements were successfully placed. The highest package and average package bagged by MTech CSE students were INR 36 LPA and INR 20.70 LPA, respectively. The DTU CSE average package has improved year-on-year over the past three years, however, a fluctuating trend was recorded in the highest package. Take a look at the table below elaborating on the DTU placement trends for MTech CSE: Particulars MTech CSE Placement Statistics (2021) MTech CSE Placement Statistics (2022) MTech CSE Placement Statistics (2023) No. of students registered 21 24 20 No. of students placed 18 19 20 No. of offers 22 28 20 Highest package INR 33 LPA INR 40 LPA INR 36 LPA Average package INR 14.99 LPA INR 18.30 LPA INR 20.70 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "Who are the top recruiters at DTU placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The list of eminent companies that were part of Delhi Technological University placements 2024 is presented below: DTU Placements 2024: Top Recruiters Myntra JP Morgan & Chase Google Airtel PwC Salesforce Bain & Company Accenture D. E. Shaw & Co."
                }
            },
            {
                "@type": "Question",
                "name": "How are the placement statistics at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The complete insights of DTU placements 2024 are tabulated below: Particulars Placement Statistics (2024) the highest package INR 85.30 LPA (Domestic) Average package INR 15.45 LPA No. of offers 2,053 No. of offers with CTC above INR 20 LPA 326 Students placed 1,900+ Total recruiters 350+"
                }
            },
            {
                "@type": "Question",
                "name": "How many students were placed during DTU placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The table below depicts the number of students placed during Delhi Technological University placements 2024: Particulars Placement Statistics (2024) No. of students placed 1,900"
                }
            },
            {
                "@type": "Question",
                "name": "How are the BDes placements at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The important details related to DTU placements 2024 for BDes are mentioned below: Particulars BDes Placement Statistics (2024) the highest package INR 27 LPA Popular recruiters Tekion, Honda, Cvent"
                }
            },
            {
                "@type": "Question",
                "name": "How were DTU MBA placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The University has released the placement statistics for MBA (DSM) and MBA (USME). A total of 117 job offers were rolled among the 115 MBA students placed during the 2023 placements. The key highlights related to DTU placements 2023 for MBA are mentioned below: Particulars MBA (DSM) Placement Statistics (2023) MBA (USME) Placement Statistics (2023) No. of students registered for placements 133 102 No. of students placed 73 42 No. of offers 74 43 Average package INR 8.96 LPA INR 9.02 LPA Highest package INR 14.50 LPA INR 23.78 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "How many companies participated in DTU MBA placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Over 160 companies participated in the MBA placements 2023. Earlier, more than 150 companies were part of MBA placements 2022. The following table depicts the DTU placement trends in terms of total recruiters: Particulars MBA Placement Statistics (2021) MBA Placement Statistics (2022) MBA Placement Statistics (2023) Total recruiters 110+ 150+ 160+"
                }
            },
            {
                "@type": "Question",
                "name": "Which was the top recruiting sector during DTU MBA placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Finance emerged as the top recruiting sector with 24.20% of the MBA batch 2021-23 placed in it. The snip below illustrates the sector-wise split of DTU MBA placements 2023: Source: Official MBA Placement Brochure 2021-23"
                }
            },
            {
                "@type": "Question",
                "name": "What was the package offered during DTU MTech placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "During the DTU M.Tech placements 2023, the AFI branch recorded the highest package of INR 51.03 LPA. The highest average package stood at INR 26.96 LPA and was offered to SPD branch students. The table below depicts the DTU average package and the highest package for the top 6 M.Tech branches: MTech Branch Average Package (2023) the highest Package (2023) CSE INR 20.70 LPA INR 36 LPA SPD INR 26.96 LPA INR 38.67 LPA C&I INR 23.65 LPA INR 36 LPA DSC INR 22.49 LPA INR 30.83 LPA AFI INR 19.58 LPA INR 51.03 LPA VLS INR 23.33 LPA INR 38.67 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "How are M.Tech placements at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The table below represents the DTU M.Tech placement trends for the past three years: Particulars MTech Placement Statistics (2021) MTech Placement Statistics (2022) MTech Placement Statistics (2023) the highest package INR 33 LPA INR 40 LPA INR 51.03 LPA Average package* INR 17.50 LPA INR 22.22 LPA INR 26.96 LPA Offers Made 147 241 238 Students Placed 132 191 207 Students Registered 244 266 282 *The amount mentioned is the highest average package among all the branches of MTech."
                }
            },
            {
                "@type": "Question",
                "name": "Which was the top MTech branch during DTU placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "As per the latest report, VLS was the top M.Tech branch during 2023 placements with the highest number of students placed and the highest number of offers attracted. The table below showcases the DTU placement statistics 2023 top 5 M.Tech branches: MTech Branch Students Registered (2023) Students Placed (2023) Offers Made (2023) VLS 24 24 26 CSE 20 20 20 ISY 23 20 21 AFI 25 21 22 THE 17 16 20"
                }
            },
            {
                "@type": "Question",
                "name": "What is the placement package offered to MDes students during DTU placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "As of now, the highest package and recruiters data has been disclosed for MDes placements 2024, which are as follows: Particulars MDes Placement Statistics (2024) the highest package INR 24 LPA Popular recruiters Microsoft, m Disney Hotstar, Paytm"
                }
            },
            {
                "@type": "Question",
                "name": "How is the placement at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The key highlights related to Delhi Technological University placements 2024 are tabulated below: Particulars Placement Statistics (2024) the highest package INR 85.30 LPA (Domestic) Average package INR 15.45 LPA No. of offers 2,053 No. of offers with CTC above INR 20 LPA 326 Students placed 1,900+ Total recruiters 350+"
                }
            },
            {
                "@type": "Question",
                "name": "What is the highest package offered at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The table below depicts the overall the highest package offered to the 2024 batch: Particulars Placement Statistics (2024) the highest package INR 85.30 LPA (Domestic) The University has also released the DTU the highest package 2024 for BDes and MDes, which are as follows: Course the highest Package (2024) BDes INR 27 LPA MDes INR 24 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "How were DTU internships?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The University has released the internship statistics for the BDes and MDes batch 2024. The highest stipend offered was INR 1.50 lakh. The important details related to DTU internships 2024 are tabulated below: Particulars Statistics (2024) Highest stipend - INR 1.50 lakh (BDes) - INR 1 lakh (MDes) NOTE: The University has not mentioned whether the stipend amount is on a monthly basis or the entire internship duration."
                }
            },
            {
                "@type": "Question",
                "name": "Which branch has the highest placement package at DTU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The University has released the branch-wise highest salary data for BTech, MTech, and MBA. Talking about the BTech highest package, COE, IT, MCE, and EE branches recorded the highest package of INR 82.05 LPA during the 2023 placements. The following table depicts the DTU highest package 2023 for BTech: BTech Branch Highest Package (2023) COE INR 82.05 LPA IT INR 82.05 LPA MCE INR 82.05 LPA EE INR 82.05 LPA SE INR 64.23 LPA ECE INR 51.03 LPA EP INR 38.67 LPA ME INR 31 LPA AE INR 31 LPA PE INR 31 LPA BT INR 31 LPA CH INR 30.83 LPA ENE INR 30.83 LPA CE INR 18 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "How were DTU BTech placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "A total of 2,167 BTech students registered for the 2023 placement session. Out of these 1,499 were placed successfully and 1,635 offers were rolled. Check the complete insights of DTU BTech placements for the past three years from the table below: Particulars Placement Statistics (2021) Placement Statistics (2022) Placement Statistics (2023) Highest package INR 1.12 CPA INR 1.84 CPA INR 82.05 LPA Average package* INR 19.85 LPA INR 24 LPA INR 25.22 LPA No. of students placed 1,075 1,455 1,499 No. of offers 1,415 1,849 1,635 Students registered for placements 1,789 1,881 2,167 *The amount mentioned is the highest average package among all the branches of BTech."
                }
            },
            {
                "@type": "Question",
                "name": "What was the package offered during DTU BTech placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The DTU highest package offered during 2023 BTech placements was made to the COE, EE, MCE, and IT students. Alongside this, the highest average package was also recorded in the IT branch. The table below mentions the DTU placements package 2023 for the top 6 BTech branches: BTech Branch Average Package (2023) Highest Package (2023) COE INR 23.70 LPA INR 82.05 LPA EE INR 15.44 LPA INR 82.05 LPA IT INR 25.22 LPA INR 82.05 LPA MCE INR 20.71 LPA INR 82.05 LPA ME INR 11.23 LPA INR 31 LPA SE INR 20.60 LPA INR 64.23 LPA"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/delhi",
                    "name": "Colleges in Delhi"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920",
                    "name": "DTU"
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/placement",
                    "name": "placement"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "DTU Placements 2024: Highest Package, Average Package, Top Companies",
        "description": "Check DTU - Delhi Technological University Placement details, Average & Highest salary package, Top Companies, Percentage of batch placed and latest placement trends for various courses. Download Brochures & Placement details of DTU.",
        "dateModified": "2024-12-05T17:35:00+05:30",
        "datePublished": "2014-08-05T15:21:56+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/dtu-delhi-technological-university-23920/placement",
            "@type": "WebPage",
            "name": "DTU - Delhi Technological University"
        },
        "author": {
            "@type": "Person",
            "name": "AarushiKalra",
            "url": "https://www.shiksha.com/author/Aarushi153743"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1569306404phpbokZti.jpeg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]