[
    {
        "@context": "http://schema.org",
        "@type": "CollegeOrUniversity",
        "name": "Guru Gobind Singh Indraprastha University, Delhi",
        "url": "http://www.ipu.ac.in/",
        "email": "ggsipu.pr@rediffmail.com",
        "telephone": "01125302171",
        "address": "Guru Gobind Singh Indraprastha University, Sector - 16C",
        "logo": "https://images.shiksha.com/mediadata/images/1569302305phpg8lyZi.jpg"
    },
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "Is it worth doing BTech from IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "During GGSIPU Engineering placements in 2022, the highest and average package offered was INR 45 LPA and INR 12 LPA, respectively. In addition, more than 370 offers were made and 70 companies visited the campus during IPU Engineering placements 2022. The top recruiters of GGSIPU in 2022 included leading companies such as Adobe, Amazon and Rapido. During Guru Gobind Singh Indraprastha University BTech placements 2021, a total number of 260 students participated in the placement drive out of which over 127 candidates were placed. For more details regarding GGSIPU placements, Click Here."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission in GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, the university does not offer direct admissions. IP University does not allow any of the affiliated colleges/institutes/agency to grant direct admission to any of the course of the university. Hence, the university is not responsible for any amount deposited or paid by the candidate directly to the affiliated colleges/institutes of GGSIPU. Candidates are also advised to not share their User ID or Username and the login password with anyone for safety purposes."
                }
            },
            {
                "@type": "Question",
                "name": "What is the expected GGSIPU MBBS cutoff 2024?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The expected GGSIPU MBBS cutoff 2024 offered through Vardhman Mahavir Medical College is must range between 107 and 129. The UNiversity offers MBBS through North Delhi Municipal Corporation Medical College and Hindu Rao Hospital, the expected MBBS cutoff must range between 909 and is 1054 for the Geenarl category All India students. The ranks have been estimated on the basis of closing ranks of MBBS course offered throught NEET UG Round 1 Seat Allotment results. For more information regarding GGSIPU MBBS cutoff 2024, click here."
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission to BBA at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For IPU BBA course admission, candidates need to appear for the IPU CET entrance exam conducted by Guru Gobind Singh Indraprastha University. Based on IPU CET ranks, students must have to follow a seat allotment process via IPU CET Counselling. GGSIPU now also accept CUET-UG scores for admission to this UG course. Interested candidates need to apply offline by paying the requisite fee of INR 2,500."
                }
            },
            {
                "@type": "Question",
                "name": "Which IP college is best for MCA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "There are 12 IPU-affiliated colleges offering the PG course. Find below the GGSIPU colleges offering MCA courses: IPU-Affiliated Colleges offering MCA Banarsidas Chandiwala Institute of Information Technology Bharati Vidyapeeth Institute of Computers Applications and Management CDAC - Centre for Development of Advanced Computing Centre for Development of Advanced Computing Delhi Institute of Advanced Studies Guru Nanak Institute of Management HMR Institute of Technology and Management Institute of Information Technology & Management JIMS Rohini R.C. Institute of Technology Tecnia Institute of Advanced Studies VIPS Delhi"
                }
            },
            {
                "@type": "Question",
                "name": "What are the facilities available at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University offers a wide range of facilities that aid in the overall growth of an individual. The GGSIPU facilities help students to work efficiently while living their life more comfortably on the premises. The facilities are: Library: The library on the GGSIPU campus offers a plethora of resources that students and faculty can use. Students can access the National Digital Library (NDL), Grammarly Premium, electronic books, electronic journals, and more. Additionally, a lot of print resources are available to students from SpringerLink, Springer Nature, McGraw Hill, Pearson, Bloomsbury, etc. Hostels: There are 2 boys Hostels, Shivalik and Aravalli Boys hostel and 2 Girls Hostel, Nilgiri and Satpura Girls Hostel. Each room of the hostel is equipped with all basic amenities like a cot, chair table etc. Sports: There are a lot of sports amenities and resources available at GGSIPU. You can choose from a variety of games and sports like cricket, volleyball, football, basketball, powerlifting, body lifting, table tennis, yoga, arm wrestling, bodybuilding, badminton, lawn tennis, etc. for both men and women."
                }
            },
            {
                "@type": "Question",
                "name": "Is MCA available at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Guru Gobind Singh Indraprastha University offers a two-year full-time MCA course at the postgraduate level. The University also offers MCA (Lateral) course for a duration of one year. Admission to MCA is completely entrance-based and depends on candidates' performance in the National Institute of Technology Master of Computer Applications Common Entrance Test (NIMCET)."
                }
            },
            {
                "@type": "Question",
                "name": "What is the average package offered at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The average package offered during IPU USICT placements 2024 stood at INR 7.2 LPA. Further, a declining trend was witnessed in the average package offered over the past three years, which is presented below: Particulars IPU USICT Placement Statistics (2022) IPU USICT Placement Statistics (2023) IPU USICT Placement Statistics (2024) Average package INR 12 LPA INR 9 LPA INR 7.2 LPA Note: Placement data 2024 is based on on-campus drives till February 2024 Earlier, the average package offered during GGSIPU USEM placements between 2016 and 2022 stood at INR 10 LPA."
                }
            },
            {
                "@type": "Question",
                "name": "How much does it cost to study B.Ed at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total IP University B.Ed fees includes various fee components such as tuition fee, registration fee, security deposit, etc. The total tuition fee for B.Ed ranges between INR 1.1 Lacs and INR 2.2 lakh. Moreover, the tuition fee for B.Ed (special education) is INR 1.92 lakh. After seat allotment, candidates have to pay some amount of the fee to confirm their seat. The fee mentioned here is taken from the official website/sanctioning body. It is subject to changes."
                }
            },
            {
                "@type": "Question",
                "name": "What are the sports facilities offered by GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "There are a lot of sports amenities and resources available at GGSIPU. The students can choose from a variety of games and sports like cricket, volleyball, football, basketball, powerlifting, body lifting, table tennis, yoga, arm wrestling, bodybuilding, badminton, lawn tennis, etc. for both men and women. The GGSIPU facilities include several playgrounds where students can enjoy and play during their leisure time. There are basketball and football grounds where students can have a match or play for fun. There is a volleyball court too. There are 12 technical clubs and 12 cultural clubs to serve the interest of students."
                }
            },
            {
                "@type": "Question",
                "name": "What is the cutoff of IPU for BBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IP University BBA IPU CET cutoff in 2023 dropped from the past two years. Table given below mentions IPU BBA cutoff trend of the last round for General-All India category candidates: Course 2021 2022 2023 Bachelor of Business Administration 274 103 538 Bachelor of Business Administration (BBA) (Shift-II) 789 442 1478 BBA in Banking and Insurance 1136 401 1014"
                }
            },
            {
                "@type": "Question",
                "name": "My rank in IPU CET is 5574. Which college can I get under IP University for BCA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "With a rank of 5574 in IPU CET, you have a decent chance of getting admission to several colleges under IP University for the BCA (Bachelor of Computer Applications) program. While the availability of seats and cutoff ranks can vary each year, I can provide you with a list of colleges that typically offer the BCA programme under IP University. Here are some colleges under IP University that you may consider for BCA: Maharaja Surajmal Institute (MSI) Vivekananda Institute of Professional Studies (VIPS) Jagan Institute of Management Studies (JIMS) Trinity Institute of Professional Studies (TIPS) Ideal Institute of Management and Technology (IIMT) Fairfield Institute of Management and Technology (FIMT) Kasturi Ram College of Higher Education (KRCHE) Tecnia Institute of Advanced Studies (TIAS) New Delhi Institute of Management (NDIM) Delhi Metropolitan Education (DME) Please note that the availability of seats and cutoff ranks can vary each year, so it's advisable to check the official website of IP University or the respective colleges for the most accurate and up-to-date information. Additionally, consider participating in the counselling process conducted by IP University to have a better chance of securing a seat at your preferred college."
                }
            },
            {
                "@type": "Question",
                "name": "How good is an MBA from IP university, New Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University is a decent choice to pursue an MBA degree. Talking about the GGSIPU ranking, the University was ranked 65 in the Management category by the National Institutional Ranking Framework in 2024. However, Outlook in its 2024 rankings has placed the university at the 15th spot. IP University also offers placement opportunities to its students. During IPU placements for MBA in 2022 at USMS, the median package offered was INR 5.60 LPA. Additionally, the placement percentage achieved was 91%."
                }
            },
            {
                "@type": "Question",
                "name": "Is B.Ed available in IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, IP University offers two-year B.Ed course. Admission to the course is based on merit in IPU CET/CUET followed by counselling round. Moreover, the university also provide B.Ed (Special Education) courses in five specialisatons. Admission to the special education programmes is only through the IPU CET exam. Candidates are advised to check the eligibility requirements before filling out the application form."
                }
            },
            {
                "@type": "Question",
                "name": "Is GGSIPU good for B.Arch?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "{Source: B.Arch students & alumni} * Infrastructure: The college's infrastructure is considered one of the best in the region. The campus is spacious, with modern facilities such as labs, studios, and a library. The hostel rooms are comfortable, with proper laundry and mess facilities. * Faculty: The faculty members are highly experienced and knowledgeable in their respective subjects. They use a combination of modern and traditional teaching methods to facilitate learning. * Course Curriculum: While some students feel that the course curriculum is outdated, many others believe that it provides a solid foundation for future careers. The emphasis on hands-on projects and practical knowledge is seen as beneficial. * Internships and Placements: Internships are facilitated by the college, and most students secure internships during their fourth and fifth years. Although there are no campus placements, many students receive job offers from renowned companies such as DLF INFRAS, Larsen and Turbo, and TCL. * Student Life: Student life is vibrant, with cultural events and festivals regularly occurring. The campus atmosphere is lively, with plenty of space for recreation and relaxation. * Support System: Teachers are described as \"very helpful\" and supportive, providing guidance and assistance to students whenever needed. * Overall Experience: Alumni praise the college's ability to produce successful architects who excel in their professional lives. Students appreciate the opportunity to learn from experienced faculty members and develop practical skills through projects and internships. In conclusion, GGSIPU seems to be a good option for pursuing a B.Arch degree. Its strong infrastructure, talented faculty, and emphasis on practical training make it an attractive choice for those interested in the field. However, potential students should carefully consider the course curriculum and placement trends before making a decision."
                }
            },
            {
                "@type": "Question",
                "name": "What is the tuition fee for pursuing MBA at IP University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "There are multiple components included in the course total fee, such as tuition fee, registration fee, security charges, etc. Some of the components are one-time chargeable such as security deposit and registration fee. IPU MBA fee ranges between INR 1.4 lakh to INR 5.7 lakh. This fee includes tuition fees and other components. The fee mentioned here is taken from the official website/sanctioning body. It is subject to changes."
                }
            },
            {
                "@type": "Question",
                "name": "What is the minimum NEET score required to get BAMS from IP university?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "GGSIPU accepts AYUSH entrance exam scores for admission to the Bachelor of Ayurvedic Medicine and Surgery (BAMS) course. Candidates with AYUSH scores can apply for the BAMS admission at GGSIPU. Also, candidates seeking admission to BAMS can anticipate the minimum cutoff by referring to the table given below to check out the previous year's cutoff ranks for the General All India category students for R1 closing ranks in AYUSH: Course 2022 2023 Bachelor of Ayurvedic Medicine and Surgery (BAMS) 29036 33462"
                }
            },
            {
                "@type": "Question",
                "name": "Is GGSIPU good for B.Voc?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "{Source: B.Voc students & alumni} Here's what our analysis reveals: * Placement: Unfortunately, placements are poor for B.Voc students, with only 4-5 students being selected by private companies like Samsung, ThoughtWorks, and Tata Power every year. This has worsened post-COVID. * Faculty: While some teachers are good, others are inexperienced and unhelpful. Homework assignments are often given without guidance, making self-study essential. * Curriculum: The syllabus is designed to be industry-ready, but students need to put in extra effort to learn. * Infra: Infrastructure is subpar, with a dusty library and average classrooms. The lack of hostels for B.Voc students is another concern. * Scholarship: Scholarships are available, but we couldn't gather detailed information on the process. In summary, while GGSIPU has its strengths (e.g., good connectivity), B.Voc students face significant challenges in terms of placement, faculty experience, and infrastructural shortcomings. We recommend exploring other options carefully before choosing GGSIPU for your B.Voc program."
                }
            },
            {
                "@type": "Question",
                "name": "Is M.E./M.Tech at GGSIPU a good choice?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "{Source: M.E./M.Tech students & alumni} Based on the reviews and comments from students and alumni, here's a summary of what they think: Pros: * Good placements: Many students reported getting placed in top companies, with average salaries ranging from 10-12 LPA and the highest packages going up to 45 LPA. * Decent infrastructure: Students appreciated the college's infrastructure, including the library, labs, and hostels, saying they are well-maintained and offer a comfortable environment for studying. * Helpful faculty: While some teachers may not be enthusiastic about teaching, many students praised their knowledge and willingness to help with queries. * Festivals and events: Reviewers mentioned that the college has a lively campus life, with regular festivals and events, including Anugoonj, which attracts a large number of visitors. Cons: * Teaching quality: Some students felt that the teaching quality could be improved, citing instances of unengaged teachers or difficulty in grasping certain concepts. * Limited hands-on experience: A few reviewers mentioned that the course lacks practical exposure, with some students feeling that they didn't get enough opportunities to apply what they learned in real-world scenarios. * High expectations vs reality: Some students expressed disappointment due to mismatched expectations regarding placements, curriculum, or faculty engagement. Verdict: Based on the mixed feedback, it seems that M.E./M.Tech at GGSIPU has its strengths and weaknesses. While students appreciate the good placements, infrastructure, and helpful faculty, there are concerns about teaching quality and limited hands-on experience. Ultimately, whether M.E./M.Tech at GGSIPU is a good choice depends on individual preferences and priorities."
                }
            },
            {
                "@type": "Question",
                "name": "What is the hostel fee at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University's annual hostel cost is INR 29,500. Mess and welfare fees are not included in the hostel fees. The fee for the mess is INR 36,000, while the cost of the welfare is INR 3,000. Candidates need to submit three demand drafts: one for hostel fees, one for mess charges, and one for welfare charges. Two hostels are maintained on campus for male students, and two are maintained for female students. There are more than 180 single-seat rooms in each hostel. Basic furnishings such as a cot, mattress, pillow, chair, table, cupboard, tube lamp, and fan are provided in each room. Mess facilities are available for residents in each hostel. Residents also have access to a common area, a gym, a reading room, and sports facilities. For the hostels, there is a provision for 24-hour water and electrical services."
                }
            },
            {
                "@type": "Question",
                "name": "How good is the BBA at IP University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IPU is counted among the good universities in the country. GGSIPU is ranked 1001-1200 by the QS World University Rankings 2024. In the NIRF 2024 ranking, it was ranked 80 under the \"University\" category. The placement data for the GGSIPU BBA course is not available as of now. However, during GGSIPU placements in 2022, the highest and average package offered stood at INR 45 LPA and INR 12 LPA, respectively for IPU Engineering (USCIT) placements."
                }
            },
            {
                "@type": "Question",
                "name": "How many total seats are there at IPU for BCA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University offers a three-year full-time BCA course at the undergraduate level. The course is also being offered via several affiliated colleges of GGSIPU. The total number of seats including all the affiliated colleges of IP University for the BCA course is 2,627. Given below is the list of a few affiliated colleges which offer BCA courses along with their seat intake: Institute Name Seat VIPS 360 Institute of Innovation In Technology & Management 240 Jagannath International Management School 120 Chanderprabhu Jain College of Higher Studies & School of Law 90"
                }
            },
            {
                "@type": "Question",
                "name": "Is MCA 2 or 3 years in IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "As per the IP University 2023 brochure, the duration of all the MCA courses is two-year. The course is further divided into semester pattern. There are four semesters during the course. The syllabus might also be defined semester-wise. Candidates have to pass all the semester exams in order to get a MCA degree from IPU."
                }
            },
            {
                "@type": "Question",
                "name": "Who are eligible for MCA course at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For admission to MCA at IP University, aspirant must have a valid BCA/BSc in Information Technology/ BSc in Computer Science degree and studied Mathematics in Class 12 or graduate level to be eligible. In addition, the candidate should have passed the degree course from a recognised university with a minimum of 55% aggregate. The degree and pass certificates (original and copies) should be kept handy during the application form filling and admission process. These documents are required for verification purposes."
                }
            },
            {
                "@type": "Question",
                "name": "What is the closing rank in the NEET for an MBBS at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Sign Indraprastha University admission 2023 to MBBS course is based on NEET UG scores followed by NEET UG counselling. The university offers MBBS admission through two affiliated colleges including North Delhi Municipal Corporation Medical College and Hindu Rao Hospital and North Mahavir Medical College. The MCC has released NEET UG Round 5 Seat Allotment results as the conclusing round. MBBS offered through VMMC has closed at 113 and NDMC has closed on 1063 for. The table mentioned below shows the latest closing ranks for GGSIPU MBBS cutoff 2023, along with last two years of cutoff: College 2021 2022 2023 North Mahavir Medical College 143 129 113 North Delhi Municipal Corporation Medical College and Hindu Rao Hospital 1118 1069 1063"
                }
            },
            {
                "@type": "Question",
                "name": "How is the library at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University has a state-of-the-art infrastructure. The library at IP University is centrally air-conditioned and fully automated. The library is well stocked with 67,000 books, 12,000 e-books, 15,000 journals, and subscriptions to 14 online databases. Remote access is available to the students and faculty for the resources along with the WebOPAC facility. Besides all these facilities, students also have access to 05 DPL's Zonal Libraries and 37 library units across Delhi. The students can avail of Newspaper archives from 1952+ and 6000+ e-resources."
                }
            },
            {
                "@type": "Question",
                "name": "Is CAT compulsory for MBA at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "No, CAT is not the only exam based on which admission is granted. GGSIPU accepts the CAT percentile for MBA admission basis on which a merit list of selected candidates is released for the counselling round. Moreover, for the MBA in IT course, the university conducted IPU CET exam is accepted. In case the seats are left vacant after CAT candidates, then the seat allotment is carried out based on the candidate's CMAT scores."
                }
            },
            {
                "@type": "Question",
                "name": "Does IPU offers scholarship?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For students, GGSIPU in Delhi offers a variety of active scholarship programmes. Most of these scholarship initiatives' funding comes from the Indian government or state governments. Numerous merit-based scholarships are available for students who need them. The institution actively maintains need-based scholarship programmes to assist students from economically weaker sections of society with their educational fees. These scholarships at GGSIPU have different requirements for eligibility. Tabulated below is the list of scholarships offered along with their eligibility criteria: Scholarship Name Eligibility Criteria Economically Weaker Section (EWS) Scheme Family Income should not be more than INR 2.50 LPA Merit-cum-means Linked Financial Assistance Scheme Students enrolled in UG programs in any of the Delhi State Public Universities Hana Scholarship Exemplary Students or Students who are unable to pay tuition fees"
                }
            },
            {
                "@type": "Question",
                "name": "What is the eligibility criteria for the Merit cum Means scholarship offered to GGSIPU students?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The Merit cum Means scholarship is offered by Delhi Government. The objective of the scheme is to extend financial assistance to needy and meritorious students. The eligibility criteria for the scheme is tabulated below: Eligibility Qualifying Percentage Financial Assistance % Beneficiary under National Food Security Scheme 60% 100% Family Income upto INR 2.50 LPA 60% 50% Family Income between INR 2.50 LPA and INR 6 LPA 60% 25%"
                }
            },
            {
                "@type": "Question",
                "name": "What financial assistance options are available at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "GGSIPU offer scholarships to students as financial assistance. Some of the top GGSIP scholarship schemes are mentioned below: Scholarship Name Eligibility Criteria Economically Weaker Section (EWS) Scheme Family Income should not be more than INR 2.50 LPA, etc. Merit-cum-means Linked Financial Assistance Scheme Students enrolled in UG programmes in any of the Delhi State Public Universities Hana Scholarship Exemplary students or students who are unable to pay tuition fees due to financial instability"
                }
            },
            {
                "@type": "Question",
                "name": "What is Hana Scholarship at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Hana Scholarship is given by Hana Nanum Foundation every year. It is offered to those meritorious students who have difficulty paying the tuition fee due to financial problems. It is also offered to a disabled person or child of a disabled person who has attained good marks. Exemplary students with top grades can also avail this scholarship. Given below are the documents requirement and selection process for the Hana Scholarship: Documents: Application form Letter of Recommendation Documents to prove financial status Documents related to college students Selection: The term for the scholarship will be once a year. The same student can be recommended again after 1 year in case the scholarship student still meets the criteria."
                }
            },
            {
                "@type": "Question",
                "name": "What are the courses offered at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University offers UG, PG and PhD programmes. Admission to UG, PG and PhD programmes at IP University is done on the basis of qualifying exam marks or entrance exams such as IPU CET, NEET, JEE Main, etc., depending upon the nature of the programme. Tabulated below is the list of popular courses offered by Guru Gobind Singh Indraprastha University: Courses Total Tuition Fees Eligibility BTech INR 1.4 lakh - INR 7.3 lakh Class 12: 45-55 % Exams: IPU CET, JEE Main MBA/PGDM INR 1.5 lakh - INR 5.7 lakh Graduation: 50-60% Exams :JEE IPU CET BBA INR 96,500 - INR 3.2 lakh Class 12: 50% Graduation: 50-55% Exams: IPU CET, CUET-PG BBA INR 1.49 lakh - INR 3.23 lakh Class 12: 50% Exams: IPU CET BCA INR 84,900 - INR 3.3 lakh Class 12: 50% Exams: IPU CET"
                }
            },
            {
                "@type": "Question",
                "name": "Does IP University offer BBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, IP University offer a three-year Bachelor of Business Administration (BBA) course. Over 30 IPU-affiliated colleges offer the UG course. Admission to the full-time course is entrance-based. Candidates seeking admission need to take the IPU CET entrance exam. The institute also admits candidates based on CUET-UG scores for the vacant seats. Candidates shortlisted based on entrance test scores have to participate in the counselling for seat allotment."
                }
            },
            {
                "@type": "Question",
                "name": "How many subjects are there in IPU BBA course?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IPU BBA is a three-year course and is further divided into six semesters. It includes over 30 subjects. The subjects included in the first-year of the programme are: Management Process and Organisational Behavior Business Mathematics Financial Accounting and Analysis Business Economics IT Applications in Business Entrepreneurial Mindset Cost Accounting Decision Techniques for Business Business Environment E-Commerce Business Communication"
                }
            },
            {
                "@type": "Question",
                "name": "What is the specialisation for an MBA at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "GGSIPU offers an MBA in five specialisations. The table given below mentions the specialisations in which MBA is offered in IP University colleges: GGSIPU MBA Specialisations Information Technology MBA (General) Financial Analysis International Business Analytics Disaster Management (Weekend course)"
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission to B.Tech course at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "<a href=\"https://www.shiksha.com/university/guru-gobind-singh-indraprastha-university-delhi-24725/admission\">Guru Gobind Singh Indraprastha University course admissions</a> is based on the entrance examination scores. Guru Gobind Singh Indraprastha University application form can be filled out by visiting the official website. Guru Gobind Singh Indraprastha University accepted entrance exam is <a href=\"https://www.shiksha.com/university/guru-gobind-singh-indraprastha-university/ipu-cet-exam\">IPU CET</a>. IPU admission to most of the courses is based on IPU CET scores, however, the university accepts some national-level exam scores as well. JEE Main is another exam accepted by the IPU."
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission to GGSIPU for BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University BTech admission is based on a valid JEE Main score. For GGSIPU admission to BTech in Biotechnology, a candidate has to appear for IPU CET or CUET. The BTech course is the university's flagship programme, which is spread across four years, comprising eight semesters. The final selection of the IPU BTech course is carried out through a centralised counselling process. GGSIPU admission to other UG courses such as BSc, BCA, BCom (Hons), B.Ed, BA (JMC), BHMCT, BBA, BA (Hons) and BVoc, among others is based on a valid IPU CET score, conducted by the University."
                }
            },
            {
                "@type": "Question",
                "name": "When will the registration begin for BA (Hons) English and from where can I get the previous years' papers?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The admission dates for BA English (Hons) programme at Guru Gobind Singh Indraprastha University (GGSIPU) for the academic year 2023-2024 have not been officially announced yet. Generally, the application process for UG courses in GGSIPU starts in the month of March or April every year. It is recommended to keep checking the official website of GGSIPU or the admission brochure for the most up-to-date information regarding the admission dates. Regarding the previous year's question papers for the BA English (Hons) programme, you can check the official website of GGSIPU or visit the university's library to access them. The university may also release the previous year's question papers on their website as a part of the exam preparation material. Additionally, you can also find the previous year's question papers and other study materials on various online educational platforms and websites."
                }
            },
            {
                "@type": "Question",
                "name": "What to do after JEE Main session 2 result?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates preparing for IITs are only required to appear for the JEE Advanced entrance exam after qualifying JEE Main. Students who who secure above the 98th percentile in JEE Main 2024 Session 2 should start preparing for JEE Advanced 2025 immediately. Those who score between 95th and 98th percentile should focus on improving their JEE Main score by taking multiple mock tests and practicing previous year's question papers. By analysing their strengths and weaknesses, candidates can identify their areas of proficiency and topics where they need improvement. If they can achieve full marks in their practice sessions, they can start preparing for JEE Advanced. However, if they cannot score full marks, it is recommended that they appear for multiple mock test series for more practice."
                }
            },
            {
                "@type": "Question",
                "name": "What is the application process for BCA at IP University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The step-by-step IP University application process is mentioned below: Visit the official website of Guru Gobind Singh Indraprastha University. Register by entering a few basic details, including the candidate's name, email ID and contact number. An application sequence number, user ID and password for future logins and a link to the application form to proceed with further steps is then given. In the first stage of the application form, enter personal details, such as name, parents' name, age, nationality, etc. Upload the required set of documents and pay the prescribed application fee (INR 1,500) via debit card/credit card/net banking."
                }
            },
            {
                "@type": "Question",
                "name": "Which college is best for B.Ed in IP University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "GGSIPU is ranked 1001-1200 by the QS World University Rankings 2025. Guru Gobind Singh Indraprastha University (GGSIPU), also known as Indraprastha University or IPU, is recognised as a state university. IPU Delhi is a teaching-cum-affiliating university. IP University is accredited with an A++ grade by the NAAC and recognised by the UGC. IPU is also ranked 80th by NIRF 2024 under the University category, 29th by NIRF 2024 under the Architecture and Planning category, and 89th by NIRF 2024 under the Engineering category. The B.Ed programme is offered in nearly 20 IPU-affiliated colleges. Admission criteria is the same for all these courses for B.Ed programme. The selection is done based on the aspirants scores in the IPU CET/CUET-PG. Some of the IPU affiliated colleges offering B.Ed are named in the table given below: IPU B.Ed offering Affiliated Colleges Achievia Educations LLP Army Institute of Education Bhavans Leelavati Munshi College of Education Delhi Institute Of Rural Development Delhi Institute of Rural Development (Sister Branch of Dird) Delhi Teachers Training College Fairfield Institute of Management and Technology Guru Ram Dass College of Education Institute of Vocational Studies"
                }
            },
            {
                "@type": "Question",
                "name": "Which college is best for BTech in IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "There are many good Technology institutes affiliated to IP University. Some of the institutes are named in the table given below: GGSIPU Affiliated Engineering Colleges Maharaja Agrasen Institute of Technology - MAIT Maharaja Surajmal Institute of Technology - MSIT World College of Technology and Management Bharati Vidyapeeth College of Engineering Guru Tegh Bahadur Institute of Technology IIMT Group of Colleges Bhagwan Parshuram Institute of Technology HMRITM Lingaya’s Vidyapeeth Check more BTech Colleges in Delhi/NCR."
                }
            },
            {
                "@type": "Question",
                "name": "Which one is better among DTU and IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Both DTU and IPU hold a good reputation for their BTech programme. There are various factors considering which, students can decide which one to choose. In the table given below, a comparison is presented based on course fee, ranking, and average package received by the students: Engineering Institute BTech Total Tuition Fee* BTech Average Package 2022 NIRF Ranking '23 IPU INR 1.4 Lacs - INR 7.32 lakh INR 12 LPA 84 DTU INR 3 Lacs - INR 6.4 lakh INR 9.02 LPA 29 * The fee mentioned on this page is taken from the official website/sanctioning body. It is subject to changes."
                }
            },
            {
                "@type": "Question",
                "name": "What are the practical subjects included in IPU VIPS Delhi for MCA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The practical labs included in the GGSIPU VIPS MCA course curriculum are: Design and Analysis of Algorithms Lab Artifical Intelligence and Machine Learning Lab Lab based on Core Electives"
                }
            },
            {
                "@type": "Question",
                "name": "What are theory and practical subjects included in IPU BTech CSE second semester?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The theory and practical subjects included in the GGSIPU BTech CSE third semester are mentioned in the table below: Theory Subjects Practical Subjects Applied Mathematics-III Switching Theory and Logic Design Lab Foundation of Computer Science Data Structure Lab Switching Theory and Logic Design Circuits and Systems Lab Circuits and Systems Computer Graphics and Multimedia Lab Data Structure - Computer Graphics and Multimedia -"
                }
            },
            {
                "@type": "Question",
                "name": "In which specialisations does IP University offer BTech?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The four-year course is offered in several different specialisations. The following table mentions some of the BTech specialisations offered by IPU colleges: GGSIPU BTech Specialisations Computer Science and Engineering Automation and Robotics Industrial Internet of Things Electronics and Communication Engineering Artificial Intelligence and Machine Learning Information Technology Biotechnology Artfificial Intelligence and Data Science -"
                }
            },
            {
                "@type": "Question",
                "name": "What are the subjects in the IPU MCA in Software Engineering first semester?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The thory and practical subjects included in the GGSIPU MCA in Software Engineering first-semester are: Theory Subjects Database Management System Computer Organisation and Architecture Software Engineering Data Structure and Algorithm Foundation of Computer Science Object Oriented Programming Practical Subjects Database Management System Lab Data Structure and Algorithm Lab Software Engineering Lab Object Oriented Programming Lab - -"
                }
            },
            {
                "@type": "Question",
                "name": "Is BSc offered at IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, IP University offer BSc (Hons) course in Nursing. This UG programme is offered by the university and the Vardhman Mahavir Medical College. For admission to this course, aspirant must fulfil the eligibility requirements and have a valid score of IPU CET/CUET/NEET. The application form can be filled out through the university official website."
                }
            },
            {
                "@type": "Question",
                "name": "What is the minimum cutoff required in JEE Main to get admission in IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Based on JEE Main ranks, GGSIPU offers admission to various BTech courses. Tabulated below are the Round 1 Closing ranks for GGSIPU BTech cutoff 2023 for All India Quota and Home State Quota for General category students: Course R1 (Closing Rank) - All India R1 (Closing Rank)- Home State BTech + M.Tech in Computer Science Engineering 8556 18626 BTech + M.Tech in Information Technology 17550 26011 BTech + M.Tech in Electronics and Communication Engineering 24837 37666 BTech + M.Tech in Biochemical Engineering 82031 194585"
                }
            },
            {
                "@type": "Question",
                "name": "What is the JEE Mains cutoff for BTech + M.Tech in Computer Science Engineering at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "In 2022, cut off was 15339 for the General category candidates in All India quota for BTech + M.Tech in Computer Science Engineering in Guru Gobind Singh Indraprastha University. Moreover, the BTech cut off varies depending on the category and domicile/quota of the applicant. Read more about IPU Cutoff."
                }
            },
            {
                "@type": "Question",
                "name": "What is NEET UG cutoff trend for GGSIPU MBBS admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The closing ranks for GGSIPU MBBS cutoff offered through VMMC is 113 in 2023, 129 in 2022 and 143 in 2021, which marks the declining trend since last three years. For NDMC NEET UG closing cutoff ranks are 1063 in 2023, 1069 in 2022 and 1118 in 2021, which is also on the declining trend. The cutoff tren for GGSIPU MBBS admission through VMMC and NDMC is tabulated below: College 2021 2022 2023 Vardhman Mahavir Medical College 143 129 113 North Delhi Municipal Corporation Medical College and Hindu Rao Hospital 1118 1069 1063"
                }
            },
            {
                "@type": "Question",
                "name": "What is the IPU CET cutoff for B.Ed course?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The table given below presents GGSIPU IPU CET cutoff trend (for General-All India category) for B.Ed course: Course 2021 2022 2023 Bachelor of Education (B.Ed) 814 404 788"
                }
            },
            {
                "@type": "Question",
                "name": "What is the expected cutoff of IP University for a BTech in CS?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University BTech +MTech Computer Science Engineering cutoff varies year on year depending on JEE Main scores and factors affecting it. On analysing the past three year cutoff trends, the expected closing rank for Round 1 CSE cutoff for 2024 must range between 8556 and 11425 for the General category All India Quota. For the Home State Quota, GGSIPU is expected to have CSE cutoff ranging between 10502 and 18626 for General category students. For detailed analysis of IP University cutoff 2023, click here."
                }
            },
            {
                "@type": "Question",
                "name": "What is the reality of GGSIPU placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The overall placement rate recorded during GGSIPU USICT placements 2023 and 2022 was 76% and 90%, respectively. Further, the key highlights of GGSIPU USICT placements 2024 are presented below: Particulars IPU USICT Placement Statistics (2024) Highest package INR 41.2 LPA Average package INR 7.2 LPA Total offers 126 Companies visited 32 Internship offers 7 Note: Placement data 2024 is based on on-campus drives till February 2024"
                }
            },
            {
                "@type": "Question",
                "name": "What is the highest package offered during GGSIPU placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The highest package offered during GGSIPU USICT placements 2024 stood at INR 41.2 LPA. Further, the highest package offered over the past three years during USICT placements is presented below: Particulars IPU USICT Placement Statistics (2022) IPU USICT Placement Statistics (2023) IPU USICT Placement Statistics (2024) Highest package INR 45 LPA INR 23 LPA INR 41.2 LPA Note: Placement data 2024 is based on on-campus drives till February 2024 Earlier, the course-wise the highest package offered during IPU placements 2022 is presented below: Course Highest Package (2022) USEM (MSc) INR 162 LPA Note: USEM the highest package 2022 data presented above is the highest package offered from placements 2016 to placement 2022 drives."
                }
            },
            {
                "@type": "Question",
                "name": "How are the placements at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The key highlights of GGSIPU USICT placements 2024 as compared with 2023 and 2022 are presented below: Particulars IPU USICT Placement Statistics (2022) IPU USICT Placement Statistics (2023) IPU USICT Placement Statistics (2024) Highest package INR 45 LPA INR 23 LPA INR 41.2 LPA Average package INR 12 LPA INR 9 LPA INR 7.2 LPA Total offers 370+ 190+ 126 Companies visited 70+ 130+ 32 Internship offers 120+ 100+ 7 Note: Placement data 2024 is based on on-campus drives till February 2024 The placement rate recorded in 2023 and 2022 was 76% and 90%, respectively."
                }
            },
            {
                "@type": "Question",
                "name": "What is the average package offered during GGSIPU MBA placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "GGSIPU MBA placement data 2024 is not released. However, according to GGSIPU Management NIRF report 2024, the median package offered over the past three years during IPU MBA placements is presented below: Course Median Package (2021) Median Package (2022) Median Package (2023) MBA INR 5.2 LPA INR 5.6 LPA INR 6.18 LPA"
                }
            },
            {
                "@type": "Question",
                "name": "How are GGSIPU BArch placements?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "GGSIPU BArch placement data is not released. However, as per the Architecture & Planning NIRF report 2024, the key highlights of IPU BArch placements over the past three years are presented below: Particulars BArch Placement Statistics (2021) BArch Placement Statistics (2022) BArch Placement Statistics (2023) Median package INR 3 LPA INR 3.2 LPA INR 3.44 LPA Total students 80 75 78 Students placed 75 72 73 Students opted for higher studies 5 3 5"
                }
            },
            {
                "@type": "Question",
                "name": "Can we get admission to IPU through CUET?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, GGSIPU accepts CUET scores. For UG courses, CUET-UG and similarly for the PG courses, CUET-PG is applicable. However, it must be noted that preference is given to CUET scores after the respective national-level exams and the Common Entrance Test (CET) conducted by the university. Some of the UG and PG programmes for which this entrance score is accepted are MCA, MA, BSc, BBA and allied programmes, BPharm, BCom (Hons), etc."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get direct admission in IPU BCA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "GGSIPU does not allow any of the affiliated colleges/institutes/agencies to grant direct admission to BCA courses. Hence, the university is not responsible for any amount deposited or paid by the candidate directly to the affiliated colleges/institutes of GGSIPU. Candidates are also advised to not share their User ID or Username and the login password with anyone for safety purposes."
                }
            },
            {
                "@type": "Question",
                "name": "Is IPU admission open?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, GGSIPU (IP University) admissions 2025 are open. The IPU CET 2025 applications are open for UG and PG courses, and the last date is Mar 31, 2025. Further, the IPU CET 2025 exams are to be held from Apr 26 to May 18, 2025. Candidates can apply online on the official website of the university. IPU applications for all the affiliated institutes is conducted through a centralised application portal, which is directly accessible from the official website of GGSIPU."
                }
            },
            {
                "@type": "Question",
                "name": "How can I get admission to GGSIPU for MBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates seeking admission to the GGSIPU MBA course must visit the official website of the University to apply online. Guru Gobind Singh Indraprastha University MBA admission is based on candidates' performance in the CAT entrance examination. IPU also accepts CMAT scores. The final selection will be done on the basis of the student's performance in the Group Discussion & Personal Interview process. However, for IPU MBA in IT admission, GGSIPU conducts IPU CET, followed by a University-level counselling process."
                }
            },
            {
                "@type": "Question",
                "name": "How to apply for MCA at IP University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For Guru Gobind Singh Indraprastha University MCA admission, candidates need to appear for the NIMCET entrance test. IP University MCA (lateral) entry admission is based on the IPU CET entrance test. In case of vacant seats after counselling, GGSIPU will consider Common Entrance Test (CET), conducted by GGSIP University for MCA admission. Candidates can fill out the accepted exams form through the official website of the conducting bodies. Furthermore, eligible candidates have to go to thr IPU official website to register and fill out the application form. All the details in the online application should be filled out as per the official documents. Also, application must be submitted within the prescribed due date."
                }
            },
            {
                "@type": "Question",
                "name": "What is the required qualification for IPU BCA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates applying for BCA in IP University colleges must meet the eligibility criteria. To be eligible to take admission, aspirant must be a Class 12 pass in the relevant group of subjects with 50% aggregate. The student should have studied English (core or elective or functional) and Mathematics/Computer Science/Informatics Practice/Computer Applications/Multimedia & Web Technology/Data Management Application/Web Application as compulsory subjects of a non-vocational stream with 50 theory and 50 practical ratios."
                }
            },
            {
                "@type": "Question",
                "name": "Does GGSIPU have an entrance exam?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, Guru Gobind Singh Indraprastha University conducts a Common Entrance Test (CET) for admission to BSc, BCA, BCom (Hons), B.Ed, BA (JMC), BHMCT, BBA, BA (Hons), BVoc, BPT, BPO, BOT, BASLP, BSc MLT, MSc, MA, MEd, MPT, MOT and MPO courses. IPU CET exam 2025 application forms for other courses, open tentatively in March every year. Apart from conducting <a href=\"https://www.shiksha.com/university/guru-gobind-singh-indraprastha-university/ipu-cet-exam\">IPU CET</a>, GGSIPU also accepts several national-level entrance exams to provide admission to a few undergraduate, postgraduate and doctoral courses."
                }
            },
            {
                "@type": "Question",
                "name": "What is the eligibility criteria to get admission to MBA programme at GGSIPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Candidates seeking admission to this course need to appear for the CAT entrance test. The final selection is based on candidates' performance in the GD & PI round. Apart from a valid CAT score, students are also required to fulfil the minimum eligibility criteria. To be eligible for GGSIPU MBA admission, candidates must have a bachelor's degree in any stream with a minimum aggregate of 50% to 60%."
                }
            },
            {
                "@type": "Question",
                "name": "How much is the IPU BA tuition fees?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The total tuition fee for BA/BA (Hons) course offered through IP University ranges between INR 2 Lacs and INR 3.2 lakh. This fee range is inclusive of BA courses offered at various IP-affiliated colleges. Moreover, the total course fee includes other components as well, such as caution deposit, hostel fee, meal plan, etc. The tuition fee component has to be paid annually/semesterly. It must be noted that the given fee amount is as per the official website/sanctioning body. It is still subject to change and hence, is indicative."
                }
            },
            {
                "@type": "Question",
                "name": "What is the fees for BBA in IPU?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IPU BBA fee includes several components, such as tuition fee, registration fee, security charges, etc. The tuition fee for the UG courses range between INR 96,500 and INR 4.2 lakh. This fee range is cumulative of courses offered by the university through its affiliated colleges, hence may vary. This information is sourced from official website/ sanctioning body and is subject to change. Candidates can visit the IP University official website (ipu.ac.in) to get more information on the fee structure or get in touch with the admission office."
                }
            },
            {
                "@type": "Question",
                "name": "What is the rank of IP University for MBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The University School of Management Studies, which is Guru Gobind Singh Indraprastha University on-campus business school is ranked #65 in the NIRF 2024 rankings under the Management category. Its rank has improved by one position in 2023. In comparison with 2022 ranking, GGSIPU ranking has slipped from 62nd position in 2022 to 66 in 2023."
                }
            },
            {
                "@type": "Question",
                "name": "What is the rank of GGSIP University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Guru Gobind Singh Indraprastha University is one of the top public universities in New Delhi, India. It is ranked 1401+ in QS World University Rankings 2024. It has also been ranked by NIRF under various categories. Tabulated below is the list of ranks awarded to IP University by international and national organisations under different categories: Ranking Body Category Ranking QS World University Rankings 2025 University 1001-1200 QS World Rankings 2024 University 1401+ NIRF 2023 Law 19 NIRF 2023 Management 66 NIRF 2023 University 74 NIRF 2023 Engineering 84"
                }
            },
            {
                "@type": "Question",
                "name": "What is the closing rank for BTech +MTech in Chemical Engineering at Guru Gobind Singh Indraprastha University?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "GGSIPU's opening and closing rank depends on the category and quota of candidates. For the general category under All India, the closing rank was 135489 in 2024. Cut off are different when it comes to other categories or female candidates and even the domicile of the home state. Admission to BTech +MTech in Chemical Engineering at Guru Gobind Singh Indraprastha University is based on the scores obtained in the entrance exam JEE. Applicants are advised to confirm what category are they applying for while checking for cut-offs."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get admission to Guru Gobind Singh Indraprastha University in BTech +M.TechCSE if my rank is between 15000 and 20000?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For last year, the closing rank for BTech +M.Techin Computer Science Engineering was 15339 which is very close to this range. This was for the general category under the All India quota. Unless the candidate belongs to some other category or domicile, one cannot afford to score less than this. With this rank, there is a probability of getting admission however since, the cut-offs keep changing year on year, it's advisable to try to score better ranks to increase your chances of getting admission to Guru Gobind Singh Indraprastha University."
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/delhi",
                    "name": "Colleges in Delhi"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/guru-gobind-singh-indraprastha-university-delhi-24725",
                    "name": "GGSIPU"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "GGSIPU: Courses, Admission 2025, Fees, Rankings, Cut off, Placements, Eligibility",
        "description": "Guru Gobind Singh Indraprastha University, Delhi offers 759 Courses across 17 Streams. Read 12897 Student Reviews, 1947 comments. Also Download Brochures & details on Cutoff, Placements, Fees & Admissions for various courses at GGSIPU.",
        "dateModified": "2025-02-19T10:27:00+05:30",
        "datePublished": "2014-07-16T15:25:07+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/guru-gobind-singh-indraprastha-university-delhi-24725",
            "@type": "WebPage",
            "name": "Guru Gobind Singh Indraprastha University"
        },
        "author": {
            "@type": "Person",
            "name": "SaumyaSrivastava",
            "url": "https://www.shiksha.com/author/Saumya160079"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1569302305phpg8lyZi.jpg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]