[
    {
        "@context": "http://schema.org",
        "@type": "CollegeOrUniversity",
        "name": "IIT Delhi",
        "url": "https://home.iitd.ac.in/",
        "email": "info@iitd.ac.in",
        "telephone": "01126597135",
        "address": "Indian Institute of Technology, IIT Delhi Main Rd, IIT Campus",
        "logo": "https://images.shiksha.com/mediadata/images/1687868166php8yeOso.jpeg"
    },
    {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": [
            {
                "@type": "Question",
                "name": "Can I get IIT Delhi with 500 rank?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Yes, you can get into IIT Delhi with 500 rank. As per the IIT Delhi Cutoff 2024, the last round closing ranks ranged between 116 and 6102 for the General AI category students. There are a few courses available at 500 rank including BTech in CSE and BTech in Mathematics and Computer Engineering. The table provided below mentions the courses available at rank 500, for the General All India category candidates: Course 2024 <a href=\"https://www.shiksha.com/university/iit-delhi-indian-institute-of-technology-53938/course-b-tech-in-computer-science-and-engineering-110582\">B.Tech. in Computer Science and Engineering</a> 116 <a href=\"https://www.shiksha.com/university/iit-delhi-indian-institute-of-technology-53938/course-discontinued-jul2024-integrated-b-tech-m-tech-in-computer-science-and-engineering-204299\">Integrated B.Tech. + M.Tech. in Computer Science and Engineering</a> 204 <a href=\"https://www.shiksha.com/university/iit-delhi-indian-institute-of-technology-53938/course-discontinued-jul2024-integrated-b-tech-m-tech-in-mathematics-and-computing-236952\">Integrated B.Tech. + M.Tech. in Mathematics and Computing</a> 417 <a href=\"https://www.shiksha.com/university/iit-delhi-indian-institute-of-technology-53938/course-b-tech-in-mathematics-and-computing-engineering-252103\">B.Tech. in Mathematics and Computing Engineering</a> 332"
                }
            },
            {
                "@type": "Question",
                "name": "How much rank in JEE Advanced is required for IIT Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The IIT Delhi cutoff 2024 has been concluded for admission to the BTech and Integrated BTech courses. As per the JEE Advanced 2024 cutoff for the Last Round, the closing rank for BTech ranged between 116 and 4849 for the General AI category students. The toughest course to get into IIT Delhi was CSE. So, candidates seeking admission at this institute must aim to secure up to 4850 rank to be eligible for BTech admission. The required cutoff ranks will vary based on the categories you fall into. To get an idea of the category-wise JEE Advanced cutoff range for BTech admission at IIT Delhi, refer to the table below: Category JEE Advanced Round 1 JEE Advanced Last Round General 116 - 4754 116 - 4849 OBC 89 - 3068 89 - 2749 SC 48 - 1765 50 - 1780 ST 23 - 991 23- 991 EWS 33 - 1139 35 - 1215 PWD 5 - 159 5 - 159"
                }
            },
            {
                "@type": "Question",
                "name": "I am getting IIT Delhi and IIT Bombay for Chemical and IIT Gandhinagar for CSE. What should I opt for?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "JEE Advanced cutoff 2024 has been released for the last round. For IIT Delhi and IIT Bombay, the last round cutoff for Chemical Engineering were 2221 and 2545, respectively, for the General AI category candidates. For IIT Gandhinagar, the last round cutoff for CSE was 1708. So, to answer your question, IIT Delhi and IIT Bombay are always a good options as compared to IIT Gandhinagar based on their NIRF ranking. For Chemical Engineering, both IIT Delhi and IIT Bombay are highly recommended as they have excellent faculty, research opportunities, and strong alumni networks. Also, Chemical Engineering offers you an opportunity to work in PSU, whereas CSE students don’t have that opportunity. However, On the other hand, a CSE student have an opportunity to work in MNC’s with higher salary package even more than what PSU’s give. But since, IIT Gandhinagar has been ranked 18th in the NIRF Ranking 2024, you must consider its other aspects such as placement, ROI etc to take your decision."
                }
            },
            {
                "@type": "Question",
                "name": "What is IIT Delhi cutoff 2024?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi Cutoff 2024 was concluded for BTech courses based on JEE Advanced scores (ranks). The closing cutoff for various BTech courses ranged between 116 and 6102, for the General AI Category candidates. The highest in-demand course was BTech in CSE. The least competitive course among the General AI candidates was BTech in Textile Technology. Candidates can find the closing cutoff ranks for various BTech courses in the table below: JEE Advanced Last Round Closing Rank (General-All India) Course 2024 B.Tech. in Mechanical Engineering 1782 B.Tech. in Chemical Engineering 2221 B.Tech. in Textile Technology 6102 B.Tech. in Civil Engineering 4169 B.Tech. in Computer Science and Engineering 116 B.Tech.0 in Electrical Engineering 625 B.Tech. in Production and Industrial Engineering 3089 B.Tech.0 in Electrical Engineering (Power and Automation) 810 Integrated B.Tech. + M.Tech. in Chemical Engineering 3646 B.Tech.8 B.Tech. + M.Tech. in Computer Science and Engineering 204 B.Tech.5 B.Tech. + M.Tech. in Mathematics and Computing 417 B.Tech. in Biochemical Engineering and Biotechnology 4849 B.Tech.6 in Engineering Physics 2560 B.Tech. in Mathematics and Computing Engineering 332 B.Tech. in Engineering and Computational Mechanics 1194 B.Tech. in Materials Engineering 3797 B.Tech.3 in Energy Engineering 2707"
                }
            },
            {
                "@type": "Question",
                "name": "What are the courses available at IIT Delhi with JEE Advanced cutoff rank up to 2500?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi BTech Cutoff 2024 was concluded based on JEE Advanced scores across multiple courses. The closing cutoff ranks for different BTech/Integrated BTech courses ranged between 116 and 6102, for the General AI candidates. For cutoff rank upto 2500, the courses available are Mechanical Engineering, Chemical Engineering, Computer Science and Engineering, Electrical Engineering, B.Tech. in Electrical Engineering (Power and Automation), Integrated B.Tech. + M.Tech. in Computer Science and Engineering, Integrated B.Tech. + M.Tech. in Mathematics and Computing, B.Tech. in Mathematics and Computing Engineering and B.Tech. in Engineering and Computational Mechanics. The given courses are as per the last round cutoff, for the General AI category. The ranks may vary according to category and gender."
                }
            },
            {
                "@type": "Question",
                "name": "Can I get admission in IIT Delhi in BTech if my rank is between 1 and 5000?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The cut off rank in Round 6 for BTech in Computer Science and Engineering is 118 which is very close to this range. This was for general category under All India quota. Unless the candidate belongs to some other category, one can not afford to score less than this. With this rank, there is a probability of getting admission however since, the cut offs keep changing from round to round, better ranks definitely increases your chances of getting admission in IIT Delhi - Indian Institute of Technology."
                }
            },
            {
                "@type": "Question",
                "name": "How many rounds of IIT Delhi cutoff list 2024 has been released?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi JEE Advanced cutoff 2024 was released for admission to the BTech, Integrated BTech, and BArch courses across various specialisations. The JEE Advanced Counselling 2024 concluded after Round 5 of the Seat Allotment results for General, OBC, SC, ST, EWS, and PWD categories. During the IIT Delhi BTech cutoff 2024, the Last Round closing ranks varied between 116 and 6102. Among all the BTech specialisations, B.Tech. in CSE was the most sought-after course for the students belonging to the General AI category. In the first round, the IIT Delhi CSE cutoff 2024 was 116 for the same category in the AI quota."
                }
            },
            {
                "@type": "Question",
                "name": "What is the opening and closing rank for BTech in Electrical Engineering at IIT Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "Opening and Closing rank depends on the category and quota of candidates. For general category under All India, opening rank was 574 and closing rank was 574. Cut off are different when it comes to other categories or female candidates and even domicile of home state. In All India, opening and closing rank for female candidates was 1572 and 1572. Admission to BTech in Electrical Engineering in IIT Delhi is based on the scores obtained in the entrance exam JEE. Applicants are advised to confirm what category are they applying while checking for cut offs."
                }
            },
            {
                "@type": "Question",
                "name": "What has been the trend for cut off in BTech in Computer Science and Engineering in IIT Delhi in last few year?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The cutoff trend for B.Tech at IIT Delhi - Indian Institute of Technology has been increasing in the recent years. In 2022, the closing rank for B.Tech. under general category for all India quota was 102. In 2023, it increased to 118. Likewise, the cut off ranks have changed from 87 to 105 for OBC, 34 to 49 for SC, 18 to 24 for ST, 28 to 34 for EWS, 8 to 9 for PWD. This trend is likely to continue in the coming years, as the demand for engineering education in India continues to grow. Similar cut off trend can be seen for female candidates under all categories however the ranks are slightly different."
                }
            },
            {
                "@type": "Question",
                "name": "What is the cutoff for BTech at IIT Delhi for other than general categories?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi cutoff 2023 ranks for BTech in Computer Science and Engineering other than General category are mentioned below: 105 for OBC 49 for SC 24 for ST 34 for EWS 9 for PWD While the admissions are based on the scores/rank obtained in JEE Advanced, the last cut offs also change a lot depending on All India quota or Home State. It also varies if the applicant is a female."
                }
            },
            {
                "@type": "Question",
                "name": "How many entrance exam cutoffs will be released for admission to BTech at IIT Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi - Indian Institute of Technology will release 6 rounds of JEE Advanced cutoffs for admission to B.Tech. The cutoffs will be released on a rolling basis, and the seats will be filled on a first-come, first-served basis. The cutoffs will be based on the following factors: The JEE Advanced score of the candidate The category of the candidate The number of seats available in the course Candidates must visit the official website of entrance exam to read clear instructions on how to proceed with the counselling process, once the round is released."
                }
            },
            {
                "@type": "Question",
                "name": "Should I choose IIT Delhi over IIT Bombay for CAT?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi CAT Cutoff 2024 has been released for admission to the MBA course. The Institute does not release the final CAT cutoff publicly and is only accessible through account login to those candidates who appear in the CAT exam. However, going by the year-wise cutoff trends, the IIT Delhi MBA Cutoff 2024 showed that the overall CAT percentile among the General AI category candidates is 98.04. On the other hand, IIT Bombay CAT cutoff 2024 is 90 percentile for admission to the MBA course. Looking at the cutoff ranks, we can say that IIT Delhi is a more popular choice for candidates in comparison to IIT Bombay. Therefore, it would be a wise decision to choose IIT Delhi over IIT Bombay. Yet, other factors must also be considered."
                }
            },
            {
                "@type": "Question",
                "name": "Does IIT Delhi accept CAT score for MBA admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi offers MBA admission on the basis of candidates' performace in CAT exam. The Cutoff is released in the form of percentile. The IIT Delhi CAT Cutoff 2024 has been released, wherein the cutoff percentile for the General category student is 98.04. The institute offers MBA course via its Department of Management Studies (<a href=\"https://www.shiksha.com/college/department-of-management-studies-iit-delhi-hauz-khas-35998\">DMS IIT Delhi</a>). DMS IIT Delhi releases two types of CAT cutoffs, namely the qualifying CAT cutoff and the final CAT cutoff. Securing a minimum qualifying cutoff just means that the candidate is eligible for the next step in the admission procedure."
                }
            },
            {
                "@type": "Question",
                "name": "What is the cutoff of IIT Delhi for MBA?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi offers MBA admission via its Department of Management Studies (<a href=\"https://www.shiksha.com/college/department-of-management-studies-iit-delhi-hauz-khas-35998\">DMS IIT Delhi</a>) on the basis of valid CAT percentile. IIT Delhi CAT cutoff 2024 has been released for MBA admission. Basis the IIT Delhi CAT 2024 cutoff, the overall cutoff percentile was 98.04 for the General AI category students. Tabulated below is the IIT Delhi CAT sectional cutoff 2024 for the students belonging to the General category under the AI quota: Section 2024 Overall 98.04 Quants 98.04 VA-RC 98.04 DI-LR 98.04"
                }
            },
            {
                "@type": "Question",
                "name": "What is the minimum rank required to get a call from IIT Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "To get into IIT Delhi for MSc admission, IIT JAM scores (ranks) are considered. The IIT Delhi JAM Cutoff 2024 was concluded for MSc courses for different categories under the AI category. For the General AI category candidates, the closing ranks for MSc courses ranged between 32 and 541. Candidates can check the IIT Delhi MSc cutoff 2024 in the table below: Course 2024 M.Sc. in Physics 157 M.Sc.1 in Chemistry 108 M.Sc. in Mathematics 173 M.Sc. in Economics 32 M.Sc.in Biological Sciences 541"
                }
            },
            {
                "@type": "Question",
                "name": "Will I be allotted a merit rank if I don't meet cut-off marks for Part A in UCEED?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The Part A cut-off marks will be used to shortlist candidates. Part B answer booklets will be evaluated only for shortlisted candidates. So, if the candidate fails to meet the qualifying cut-off criteria, his or her Part B answer boolets will not be evaluated. Consequently, the candidate will not be assigned a merit rank. It may be noted that to participate in the UCEED 2025 counseling process, the candidate needs to have a merit rank. The cut-off marks for Part A will be released around the 2nd week of February 2025."
                }
            },
            {
                "@type": "Question",
                "name": "Can I participate in counseling if I have not been assigned a merit rank in UCEED 2025?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The counseling process for UCEED 2025 will be conducted as a Joint Seat Allotment process. To participate in the counseling, the candidate must have qualified UCEED 2025 and assigned a merit rank in the UCEED 2024 exam. If the candidate doesn’t have a merit rank, he or she is not eligible to participate the counseling-cum-seat allotment process. The Joint Seat Allotment process for UCEED 2025 will be conducted in an online mode. A total of five institutes will participate in the counseling process. Seat allotment during counseling will be as per the merit rank of the candidate in UCEED 2025 and choices selected at the time of counseling registration. Also, the seat allotemt will be conducted in five rounds."
                }
            },
            {
                "@type": "Question",
                "name": "What is IIT Delhi BDes cutoff 2024?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi cutoff 2024 for the BDes course is based on the applicant's UCCED scores followed by the UCEED Counselling. The last-round closing rank for the General AI category was 35. UCEED Counselling is generally conducted in five rounds. Candidates looking for IIT Delhi admissions must meet the <a href=\"https://www.shiksha.com/design/uceed-exam\">UCEED</a> cutoff for further process of counselling. IIT Delhi UCEED Last Round cutoff 2024 has been released in the form of opening and closing ranks for various categories. The First and Last Round ranks for General AI Category candidates are mentioned below: Course Round 1 - Closing Ranks Last Round - Closing Ranks Bachelor of Design (BDes) 32 35"
                }
            },
            {
                "@type": "Question",
                "name": "How much should I score in UCEED to get into IIT Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "For General AI India category students, the UCEED cutoff for IIT Delhi B.Des admission in Round 2 was 32 in 2024. In comparison, the last round cutoff for the same category in 2023 was 40. Therefore, to be eligible for IIT Delhi B.Des admission, candidates must secure a rank between 32 and 40 in the UCEED exam. Candidates can refer to the table below to check out the categoory-wise round 1 and round 2 cutoff details for IIT Delhi B.Des admission: Category Round 1 Round 2 General 32 32 OBC 26 28 SC 10 10 ST 6 6"
                }
            },
            {
                "@type": "Question",
                "name": "I got a 7000 rank in the JEE Advanced. I am an OBC candidate. Am I eligible to get admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The JEE Advanced exam is widely conducted by IITs to offer BTech and BTech Integrated courses to various All India and Home State quotas. In 2024, IIT Delhi has released the JEE Advanced cutoff for various BTech specialisations for All India categories. For General AI quota, the cutoff rank stood between 116 and 6102. Similarly, for OBC AI quota, the JEE Advanced cutoff varied from 89 to 2749. As we can see the cutoff rank released for the OBC AI quota, the candidates acquiring a rank of 7000 won't be eligible to get a seat at IIT Delhi."
                }
            },
            {
                "@type": "Question",
                "name": "I am expecting around 100 rank in JEE Advanced 2024. Do I have a chance to get admission to IIT Delhi CSE?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "It depends on the quota you have. If you are having a OBC/SC/ST/PWD/EWS quota and you get a rank of 150, so, getting into IIT Delhi could be comparatively more difficult for you as compared to the General AI category candidates. As, for the General AI quota, the needed cutoff rank to get admission to CSE course at IIT Delhi as per the IIT Delhi JEE Advanced cutoff 2024 stood at 116. Candidates can further check out the IIT Delhi CSE category-wise cutoffs in the table below: JEE Advanced Last Round Closing Rank (General-All India) Category BTech in CSE General All India 116 OBC All India 89 SC All India 50 ST All India 23 PWD All India 5 EWS All India 35"
                }
            },
            {
                "@type": "Question",
                "name": "Can I participate in JoSAA counselling if I don't have 75% marks in class 12?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "It is mandatory to have minimum 75% marks (65% for reserved category) in class 12 to take admission in IITs, NITs, IIITs and GFTIs. Candidates should apply for JoSAA conselling only if they fulfill all the conditions of eligibility. However, many institutes admit students on the basis of JEE Main where there is no requirement of minimum marks in class 12."
                }
            },
            {
                "@type": "Question",
                "name": "I have 7000 and 4000 in the general and OBC category, respectively, Is there any chance to get IIT Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "JEE Advanced exam is one of the toughest exams of India. It is accepted by IIT Delhi. IIT Delhi is one of renowed institutiton for BTech courses for which the institute releases the round-wise seat allotments for various All India categories. Further, the IIT Delhi JEE Main cutoff 2024 stood betweed 89 and 2749 for the General AI category candidates. Meanwhile, candidates with General and OBC AI quota in 7k and 4k, respectively, rank cannot get admission to BTech courses because cutoff ranks released are much lower than achieved rank by the candidate."
                }
            },
            {
                "@type": "Question",
                "name": "Does class 12 marks matter in the eligibility criteria of IIT JAM?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "The eligibility requirements for IIT JAM (Joint Admission Test for M.Sc.) did not involve a minimum percentage or marks in Class 12 for the majority of participating institutes. The eligibility criteria for IIT JAM are largely concerned with the bachelor's degree and the minimum marks or CGPA necessary to secure in that degree. Candidates for the IIT JAM must have a Bachelor's degree from a recognized university with a minimum of 55 per cent aggregate or 5.5 CGPA/CPI. Apart from it, candidates also need to submit a physical fitness certificate at the time of admissions. Candidates found unfit to pursue his/her science course can be denied admission by the admitting institute. For the most up-to-date information, consult the official IIT JAM website or the information brochure."
                }
            },
            {
                "@type": "Question",
                "name": "What rank is required in IIT JAM for IIT Delhi MSc admission?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi MSc cutoff 2024 has been released for Round 1, wherein, JAM in Economics is the most competitive specialsiation with a closing rank of 9 for the General AII India category students. The least competitive course is M.Sc.in Biological Sciences with a cutoff rank of 488. So, candidates seeking admission to any of the MSc course must secure a rank upto 488 to be eligible for IIT Delhi IIT Delhi admissio to the MSc course is based on IIT JAM scores, followed by IIT JAM counselling process. Only candidates in the JAM 2024 Merit List based on JAM 2024 scorecard will be eligible to apply for admission."
                }
            },
            {
                "@type": "Question",
                "name": "What is the cut off for MSc Physics at IIT Delhi?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi MSc cutoff 2024 was concluded with the released of IIT JAM Round 5 Seat Allotment result. As per the IIT Delhi JAM cutoff 2024, the last round closing rank for MSc ranged between 32 and 541 in the General AI quota. For MSc in Physics, the cutoff closed at 157. Candidates seeking admission to MSc in Physics at IIT Delhi can refer to the table below to check out the IIT JAM category-wise last round closing ranks: Category MSc in Physics (Last Round Closing Ranks) General 157 OBC 308 SC 1309 ST 2809 EWS 280 PWD 6450"
                }
            },
            {
                "@type": "Question",
                "name": "How is IIT Delhi JAM cutoff 2024 different from that of 2023?",
                "acceptedAnswer": {
                    "@type": "Answer",
                    "text": "IIT Delhi JAM Cutoff 2024 was different in terms of the opening and Closing ranks. In 2024, the last-round closing cutoff ranks for different MSc courses among the General AI categories closed at a range of 32 and 541. Whereas, in 2023, the Cutoff ranks for different courses closed at a range of 11 and 164, during it's last round. For more information, candidates can check the table provided below that includes the 2023 and 2024 Cutoff ranks during the last round: Course 2023 2024 M.Sc. in Physics 183 157 M.Sc. in Chemistry 115 108 M.Sc. in Mathematics 164 173 M.Sc. in Economics 11 32 M.Sc.in Biological Sciences – / – 541"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.shiksha.com/",
                    "name": "Home"
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.shiksha.com/colleges/delhi",
                    "name": "Colleges in Delhi"
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.shiksha.com/university/iit-delhi-indian-institute-of-technology-53938",
                    "name": "IIT Delhi"
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.shiksha.com/university/iit-delhi-indian-institute-of-technology-53938/cutoff",
                    "name": "Cutoff"
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Article",
        "inLanguage": "en",
        "headline": "IIT Delhi Cutoff 2025: Check JEE Advanced Closing Ranks For Previous Years",
        "description": "IIT Delhi Jee Advanced cutoff 2025 will be released soon. In the meantime, candidates can check out the IIT Delhi cutoff 2024 across different courses and categories here.",
        "dateModified": "2025-03-21T17:15:00+05:30",
        "datePublished": "2024-10-04T16:34:26+05:30",
        "mainEntityOfPage": {
            "id": "https://www.shiksha.com/university/iit-delhi-indian-institute-of-technology-53938/cutoff",
            "@type": "WebPage",
            "name": "IIT Delhi - Indian Institute of Technology"
        },
        "author": {
            "@type": "Person",
            "name": "Yatendra Kumarnull",
            "url": "https://www.shiksha.com/author/YatendraKumar94720"
        },
        "publisher": {
            "@type": "Organization",
            "name": "Shiksha.com",
            "logo": {
                "@type": "ImageObject",
                "name": "Shiksha.com",
                "url": "https://images.shiksha.ws/pwa/public/images/schema/shiksha_logo.jpg",
                "height": "100",
                "width": "239"
            }
        },
        "image": {
            "@type": "ImageObject",
            "url": "https://images.shiksha.com/mediadata/images/1687868166php8yeOso.jpeg"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "WebSite",
        "name": "Shiksha.com",
        "url": "https://www.shiksha.com",
        "potentialAction": {
            "@type": "SearchAction",
            "target": "https://www.shiksha.com/search?q={search_term_string}",
            "query-input": "required name=search_term_string"
        }
    },
    {
        "@context": "http://schema.org",
        "@type": "Organization",
        "url": "https://www.shiksha.com",
        "logo": "https://www.shiksha.com/public/images/nshik_ShikshaLogo1.gif",
        "name": "Shiksha.com",
        "sameAs": [
            "https://www.facebook.com/shikshacafe",
            "https://twitter.com/ShikshaDotCom",
            "https://in.linkedin.com/company/shiksha-com-a-naukri-com-venture-",
            "https://www.instagram.com/shikshadotcom/",
            "https://www.youtube.com/c/shiksha"
        ]
    }
]